// JX-IDLE Monsters & Sprites Animation (1.0x Native HD)
window.JW = window.JW || {};
Object.assign(window.JW, {
  "mon": {
    "0": {
      "n": "Đông Bắc hổ",
      "img": "img/m/ani001.png",
      "sz": [
        28,
        76,
        14,
        76
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 7,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani001",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "1": {
      "n": "Hoa Nam hổ",
      "img": "img/m/ani002.png",
      "sz": [
        26,
        67,
        13,
        67
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 7,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani002",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "2": {
      "n": "Bạch Hổ",
      "img": "img/m/ani003.png",
      "sz": [
        26,
        68,
        13,
        68
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 7,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "ani003",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "3": {
      "n": "Kim Tiền báo",
      "img": "img/m/ani005.png",
      "sz": [
        26,
        68,
        13,
        68
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "ani005",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "4": {
      "n": "Báo trắng",
      "img": "img/m/ani006.png",
      "sz": [
        28,
        65,
        14,
        65
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "ani006",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "5": {
      "n": "Sói xám",
      "img": "img/m/ani009.png",
      "sz": [
        22,
        60,
        11,
        60
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani009",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "6": {
      "n": "Sói đỏ",
      "img": "img/m/ani010.png",
      "sz": [
        22,
        58,
        11,
        58
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani010",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "7": {
      "n": "Sói xanh",
      "img": "img/m/ani011.png",
      "sz": [
        20,
        53,
        10,
        53
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "ani011",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "8": {
      "n": "Sói tuyết",
      "img": "img/m/ani012.png",
      "sz": [
        22,
        56,
        11,
        56
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "ani012",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "9": {
      "n": "Hồ ly",
      "img": "img/m/ani013.png",
      "sz": [
        14,
        35,
        7,
        35
      ],
      "ranged": 0,
      "sk": [
        198,
        198,
        198,
        198
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "ani013",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "10": {
      "n": "Hỏa Hồ",
      "img": "img/m/ani015.png",
      "sz": [
        16,
        42,
        8,
        42
      ],
      "ranged": 0,
      "sk": [
        197,
        198,
        198,
        198
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani015",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "11": {
      "n": "Heo rừng",
      "img": "img/m/ani018.png",
      "sz": [
        31,
        64,
        15,
        64
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani018",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "12": {
      "n": "Nhím",
      "img": "img/m/ani019.png",
      "sz": [
        47,
        47,
        23,
        47
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "ani019",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "13": {
      "n": "Đại Tượng",
      "img": "img/m/ani021.png",
      "sz": [
        113,
        139,
        56,
        139
      ],
      "ranged": 0,
      "sk": [
        1,
        1,
        1,
        1
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "ani021",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "14": {
      "n": "Voi Hoàng hà",
      "img": "img/m/ani024.png",
      "sz": [
        113,
        139,
        56,
        139
      ],
      "ranged": 0,
      "sk": [
        1,
        1,
        1,
        1
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "ani024",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "15": {
      "n": "Gấu nâu",
      "img": "img/m/ani025.png",
      "sz": [
        35,
        64,
        17,
        64
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani025",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "16": {
      "n": "Gấu đen",
      "img": "img/m/ani026.png",
      "sz": [
        35,
        65,
        17,
        65
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani026",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "17": {
      "n": "Trâu rừng",
      "img": "img/m/ani029.png",
      "sz": [
        35,
        88,
        17,
        88
      ],
      "ranged": 0,
      "sk": [
        1,
        1,
        1,
        1
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "ani029",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "18": {
      "n": "Cá sấu",
      "img": "img/m/ani033.png",
      "sz": [
        66,
        82,
        33,
        82
      ],
      "ranged": 0,
      "sk": [
        1,
        1,
        1,
        1
      ],
      "spd": 18,
      "run": 4,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "ani033",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "19": {
      "n": "Thằn lằn đỏ",
      "img": "img/m/ani036.png",
      "sz": [
        66,
        82,
        33,
        82
      ],
      "ranged": 0,
      "sk": [
        1,
        1,
        1,
        1
      ],
      "spd": 18,
      "run": 4,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "ani036",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "20": {
      "n": "Nhãn Kính Mãng xà",
      "img": "img/m/ani037.png",
      "sz": [
        33,
        43,
        16,
        43
      ],
      "ranged": 0,
      "sk": [
        200,
        200,
        200,
        200
      ],
      "spd": 18,
      "run": 4,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani037",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "21": {
      "n": "Rắn xanh",
      "img": "img/m/ani038.png",
      "sz": [
        64,
        46,
        32,
        46
      ],
      "ranged": 0,
      "sk": [
        200,
        200,
        200,
        200
      ],
      "spd": 18,
      "run": 4,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani038",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "22": {
      "n": "Kim Hoàn Mãng Xà",
      "img": "img/m/ani039.png",
      "sz": [
        43,
        31,
        21,
        31
      ],
      "ranged": 0,
      "sk": [
        200,
        200,
        200,
        200
      ],
      "spd": 18,
      "run": 4,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "ani039",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "23": {
      "n": "Xích Luyện Xà",
      "img": "img/m/ani040.png",
      "sz": [
        51,
        62,
        25,
        62
      ],
      "ranged": 0,
      "sk": [
        200,
        200,
        200,
        200
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "ani040",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "24": {
      "n": "Kim Điêu",
      "img": "img/m/ani041.png",
      "sz": [
        77,
        24,
        38,
        24
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 8,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "ani041",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "25": {
      "n": "Thương ưng",
      "img": "img/m/ani042.png",
      "sz": [
        71,
        23,
        35,
        23
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 8,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani042",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "26": {
      "n": "Kền Kền",
      "img": "img/m/ani043.png",
      "sz": [
        76,
        27,
        38,
        27
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 8,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani043",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "27": {
      "n": "Dơi chúa",
      "img": "img/m/ani045.png",
      "sz": [
        28,
        28,
        14,
        28
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 8,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "ani045",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "28": {
      "n": "Dơi chúa đỏ",
      "img": "img/m/ani046.png",
      "sz": [
        28,
        27,
        14,
        27
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 8,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "ani046",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "29": {
      "n": "Dơi Dong",
      "img": "img/m/ani047.png",
      "sz": [
        32,
        32,
        16,
        32
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 8,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "ani047",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "30": {
      "n": "Dơi hút máu",
      "img": "img/m/ani048.png",
      "sz": [
        26,
        24,
        13,
        24
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 8,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani048",
      "tr": 1,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "31": {
      "n": "Kim Miêu",
      "img": "img/m/ani049.png",
      "sz": [
        14,
        32,
        7,
        32
      ],
      "ranged": 0,
      "sk": [
        197,
        197,
        197,
        197
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani049",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "33": {
      "n": "Hoán hùng",
      "img": "img/m/ani051.png",
      "sz": [
        23,
        37,
        11,
        37
      ],
      "ranged": 0,
      "sk": [
        197,
        197,
        197,
        197
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "ani051",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "34": {
      "n": "Linh Miêu",
      "img": "img/m/ani052.png",
      "sz": [
        16,
        38,
        8,
        38
      ],
      "ranged": 0,
      "sk": [
        197,
        197,
        197,
        197
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "ani052",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "35": {
      "n": "Tàng Vực hầu",
      "img": "img/m/ani053.png",
      "sz": [
        24,
        35,
        12,
        35
      ],
      "ranged": 0,
      "sk": [
        196,
        196,
        196,
        196
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani053",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "36": {
      "n": "Khỉ xám",
      "img": "img/m/ani054.png",
      "sz": [
        27,
        31,
        13,
        31
      ],
      "ranged": 0,
      "sk": [
        196,
        196,
        196,
        196
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani054",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "37": {
      "n": "Hắc Diệp Hầu",
      "img": "img/m/ani055.png",
      "sz": [
        27,
        35,
        13,
        35
      ],
      "ranged": 0,
      "sk": [
        196,
        196,
        196,
        196
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "ani055",
      "tr": 1,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "39": {
      "n": "Sài",
      "img": "img/m/ani058.png",
      "sz": [
        36,
        62,
        18,
        62
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "ani058",
      "tr": 1,
      "hr": 30,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "40": {
      "n": "Tuyết Quái",
      "img": "img/m/ani059.png",
      "sz": [
        42,
        63,
        21,
        63
      ],
      "ranged": 0,
      "sk": [
        53,
        102,
        53,
        53
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "ani059",
      "tr": 1,
      "hr": 30,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "41": {
      "n": "Cóc",
      "img": "img/m/ani060.png",
      "sz": [
        26,
        22,
        13,
        22
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 4,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "ani060",
      "tr": 1,
      "hr": 30,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "42": {
      "n": "Hươu đốm",
      "img": "img/m/ani061.png",
      "sz": [
        33,
        61,
        16,
        61
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 4,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "ani061",
      "tr": 1,
      "hr": 30,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "43": {
      "n": "Heo trắng",
      "img": "img/m/ani063.png",
      "sz": [
        32,
        56,
        16,
        56
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 3,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "ani063",
      "tr": 1,
      "hr": 30,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "45": {
      "n": "Nhện",
      "img": "img/m/ani066.png",
      "sz": [
        69,
        47,
        34,
        47
      ],
      "ranged": 0,
      "sk": [
        53,
        2,
        2,
        2
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        75
      ],
      "anim": "ani066",
      "tr": 1,
      "hr": 30,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "46": {
      "n": "Rết",
      "img": "img/m/ani067.png",
      "sz": [
        24,
        54,
        12,
        54
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        75
      ],
      "anim": "ani067",
      "tr": 1,
      "hr": 30,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "140": {
      "n": "Khoái Thối",
      "img": "img/m/enemy121.png",
      "sz": [
        34,
        76,
        17,
        76
      ],
      "ranged": 0,
      "sk": [
        53,
        238,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "enemy121",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "141": {
      "n": "Tây Nam sơn tặc đầu lĩnh",
      "img": "img/m/enemy122.png",
      "sz": [
        50,
        80,
        25,
        80
      ],
      "ranged": 0,
      "sk": [
        101,
        240,
        53,
        53
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy122",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "142": {
      "n": "Giang Nam sơn tặc đầu lĩnh",
      "img": "img/m/enemy123.png",
      "sz": [
        54,
        76,
        27,
        76
      ],
      "ranged": 0,
      "sk": [
        53,
        240,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "enemy123",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "143": {
      "n": "Đông Bắc sơn tặc đầu lĩnh",
      "img": "img/m/enemy124.png",
      "sz": [
        32,
        78,
        16,
        78
      ],
      "ranged": 0,
      "sk": [
        101,
        233,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "enemy124",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "144": {
      "n": "Hoa Bắc sơn tặc đầu lĩnh",
      "img": "img/m/enemy125.png",
      "sz": [
        110,
        90,
        55,
        90
      ],
      "ranged": 0,
      "sk": [
        101,
        233,
        53,
        53
      ],
      "spd": 18,
      "run": 8,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "enemy125",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "145": {
      "n": "Nam bộ sơn tặc đầu lĩnh",
      "img": "img/m/enemy126.png",
      "sz": [
        36,
        80,
        18,
        80
      ],
      "ranged": 0,
      "sk": [
        101,
        241,
        53,
        53
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "enemy126",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "146": {
      "n": "Đoạt Mệnh Liêm",
      "img": "img/m/enemy127.png",
      "sz": [
        49,
        77,
        24,
        77
      ],
      "ranged": 0,
      "sk": [
        101,
        239,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy127",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "147": {
      "n": "Đao khách",
      "img": "img/m/enemy128.png",
      "sz": [
        59,
        79,
        29,
        79
      ],
      "ranged": 0,
      "sk": [
        101,
        235,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "enemy128",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "148": {
      "n": "Báo đốm",
      "img": "img/m/enemy129.png",
      "sz": [
        51,
        90,
        25,
        90
      ],
      "ranged": 0,
      "sk": [
        101,
        235,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "enemy129",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "149": {
      "n": "Trường Thương",
      "img": "img/m/enemy130.png",
      "sz": [
        48,
        71,
        24,
        71
      ],
      "ranged": 0,
      "sk": [
        53,
        233,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "enemy130",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "150": {
      "n": "Thanh Mi",
      "img": "img/m/enemy131.png",
      "sz": [
        52,
        65,
        26,
        65
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "enemy131",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "151": {
      "n": "Mãng Hán",
      "img": "img/m/enemy132.png",
      "sz": [
        41,
        71,
        20,
        71
      ],
      "ranged": 0,
      "sk": [
        101,
        234,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy132",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "152": {
      "n": "Tây Nam sơn tặc 2",
      "img": "img/m/enemy133.png",
      "sz": [
        38,
        72,
        19,
        72
      ],
      "ranged": 0,
      "sk": [
        53,
        234,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "enemy133",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "153": {
      "n": "Giang Nam sơn tặc 1",
      "img": "img/m/enemy134.png",
      "sz": [
        29,
        69,
        14,
        69
      ],
      "ranged": 0,
      "sk": [
        101,
        237,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "enemy134",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "154": {
      "n": "Lưu Lương",
      "img": "img/m/enemy135.png",
      "sz": [
        35,
        63,
        17,
        63
      ],
      "ranged": 0,
      "sk": [
        53,
        237,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "enemy135",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "155": {
      "n": "Hắc Cân",
      "img": "img/m/enemy136.png",
      "sz": [
        40,
        71,
        20,
        71
      ],
      "ranged": 0,
      "sk": [
        53,
        236,
        53,
        53
      ],
      "spd": 18,
      "run": 5,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "enemy136",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "156": {
      "n": "Ảnh Côn",
      "img": "img/m/enemy137.png",
      "sz": [
        29,
        71,
        14,
        71
      ],
      "ranged": 0,
      "sk": [
        101,
        236,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy137",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "157": {
      "n": "Đông Bắc sơn tặc 1",
      "img": "img/m/enemy138.png",
      "sz": [
        71,
        100,
        35,
        100
      ],
      "ranged": 0,
      "sk": [
        53,
        242,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "enemy138",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "158": {
      "n": "Đông Bắc sơn tặc 2",
      "img": "img/m/enemy139.png",
      "sz": [
        27,
        68,
        13,
        68
      ],
      "ranged": 0,
      "sk": [
        53,
        242,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "enemy139",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "159": {
      "n": "Hoa Bắc sơn tặc 1",
      "img": "img/m/enemy140.png",
      "sz": [
        49,
        68,
        24,
        68
      ],
      "ranged": 0,
      "sk": [
        101,
        238,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        60,
        90,
        75,
        75
      ],
      "anim": "enemy140",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "160": {
      "n": "Hoa Bắc sơn tặc 2",
      "img": "img/m/enemy141.png",
      "sz": [
        57,
        80,
        28,
        80
      ],
      "ranged": 0,
      "sk": [
        53,
        238,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "enemy141",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "161": {
      "n": "Thiết Trảo",
      "img": "img/m/enemy142.png",
      "sz": [
        38,
        68,
        19,
        68
      ],
      "ranged": 0,
      "sk": [
        101,
        233,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        60,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy142",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "162": {
      "n": "Đoản Kích",
      "img": "img/m/enemy143.png",
      "sz": [
        53,
        78,
        26,
        78
      ],
      "ranged": 0,
      "sk": [
        53,
        233,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "enemy143",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "163": {
      "n": "sơn tặc 01",
      "img": "img/m/enemy144.png",
      "sz": [
        45,
        77,
        22,
        77
      ],
      "ranged": 0,
      "sk": [
        53,
        233,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        90,
        75,
        60,
        75,
        75
      ],
      "anim": "enemy144",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "165": {
      "n": "sơn tặc 03",
      "img": "img/m/enemy146.png",
      "sz": [
        44,
        73,
        22,
        73
      ],
      "ranged": 0,
      "sk": [
        53,
        233,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        90,
        75,
        60,
        75
      ],
      "anim": "enemy146",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "167": {
      "n": "sơn tặc 05",
      "img": "img/m/enemy148.png",
      "sz": [
        35,
        73,
        17,
        73
      ],
      "ranged": 0,
      "sk": [
        53,
        242,
        53,
        53
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        90,
        60
      ],
      "anim": "enemy148",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "557": {
      "n": "Kên đất",
      "img": "img/m/ani041.png",
      "sz": [
        77,
        24,
        38,
        24
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 16,
      "run": 8,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "ani041",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "558": {
      "n": "Bọ cạp",
      "img": "img/m/ani065.png",
      "sz": [
        38,
        50,
        19,
        50
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 16,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "ani065",
      "tr": 2,
      "hr": 10,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "588": {
      "n": "Bôn Lôi",
      "img": "img/m/enemy067.png",
      "sz": [
        37,
        79,
        18,
        79
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy067",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "589": {
      "n": "Ngân Nha",
      "img": "img/m/enemy023.png",
      "sz": [
        57,
        92,
        28,
        92
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy023",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "590": {
      "n": "Đông Bắc hổ",
      "img": "img/m/ani001.png",
      "sz": [
        28,
        76,
        14,
        76
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "ani001",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "591": {
      "n": "Độc Bộ",
      "img": "img/m/enemy082.png",
      "sz": [
        71,
        75,
        35,
        75
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy082",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "592": {
      "n": "Xích Chưởng",
      "img": "img/m/enemy107.png",
      "sz": [
        39,
        77,
        19,
        77
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy107",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "593": {
      "n": "Tuyết ảnh",
      "img": "img/m/enemy141.png",
      "sz": [
        57,
        80,
        28,
        80
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy141",
      "tr": 2,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "594": {
      "n": "Đao Trảm",
      "img": "img/m/enemy128.png",
      "sz": [
        59,
        79,
        29,
        79
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy128",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "595": {
      "n": "Lạc Quang",
      "img": "img/m/enemy021.png",
      "sz": [
        98,
        85,
        49,
        85
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy021",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "596": {
      "n": "Hàn Thương",
      "img": "img/m/enemy036.png",
      "sz": [
        41,
        66,
        20,
        66
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy036",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "597": {
      "n": "Đoạt Phách",
      "img": "img/m/enemy029.png",
      "sz": [
        49,
        78,
        24,
        78
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy029",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "598": {
      "n": "Sương Đao",
      "img": "img/m/enemy024.png",
      "sz": [
        64,
        82,
        32,
        82
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy024",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "599": {
      "n": "Lãnh Cung",
      "img": "img/m/enemy028.png",
      "sz": [
        34,
        76,
        17,
        76
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy028",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "600": {
      "n": "Giáng Chùy",
      "img": "img/m/enemy086.png",
      "sz": [
        53,
        80,
        26,
        80
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy086",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "601": {
      "n": "Sãn Vũ",
      "img": "img/m/enemy040.png",
      "sz": [
        52,
        78,
        26,
        78
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy040",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "602": {
      "n": "Phiến Khách",
      "img": "img/m/boss006.png",
      "sz": [
        56,
        85,
        28,
        85
      ],
      "ranged": 0,
      "sk": [
        164,
        165,
        164,
        165
      ],
      "spd": 12,
      "run": 6,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "boss006",
      "tr": 24,
      "hr": 100,
      "vis": 800,
      "lr": [
        0,
        1600
      ]
    },
    "699": {
      "n": "Thi Nghi Sinh",
      "img": "img/m/enemy003.png",
      "sz": [
        36,
        73,
        18,
        73
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy003",
      "tr": 0,
      "hr": 50,
      "vis": 500,
      "lr": [
        30,
        0
      ]
    },
    "700": {
      "n": "Chính Võ Sĩ",
      "img": "img/m/enemy076.png",
      "sz": [
        53,
        79,
        26,
        79
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy076",
      "tr": 0,
      "hr": 50,
      "vis": 500,
      "lr": [
        30,
        0
      ]
    },
    "701": {
      "n": "Nguyễn Minh Viễn",
      "img": "img/m/enemy147.png",
      "sz": [
        51,
        74,
        25,
        74
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy147",
      "tr": 0,
      "hr": 50,
      "vis": 500,
      "lr": [
        30,
        0
      ]
    },
    "703": {
      "n": "Phi Sa",
      "img": "img/m/enemy083.png",
      "sz": [
        54,
        77,
        27,
        77
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy083",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "704": {
      "n": "Tẩu Thạch",
      "img": "img/m/enemy078.png",
      "sz": [
        39,
        74,
        19,
        74
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy078",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "705": {
      "n": "Sa Đạo",
      "img": "img/m/enemy134.png",
      "sz": [
        29,
        69,
        14,
        69
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy134",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "706": {
      "n": "Mạc Tặc",
      "img": "img/m/enemy129.png",
      "sz": [
        51,
        90,
        25,
        90
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        90
      ],
      "anim": "enemy129",
      "tr": 3,
      "hr": 50,
      "vis": 400,
      "lr": [
        0,
        0.05
      ]
    },
    "707": {
      "n": "Thần Tý",
      "img": "img/m/enemy028.png",
      "sz": [
        34,
        76,
        17,
        76
      ],
      "ranged": 0,
      "sk": [
        239,
        201,
        239,
        201
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        75,
        75,
        75,
        75,
        75
      ],
      "anim": "enemy028",
      "tr": 2,
      "hr": 50,
      "vis": 500,
      "lr": [
        0,
        0.05
      ]
    },
    "709": {
      "n": "Liệt Không Mạc Bắc Thảo Nguyên",
      "img": "img/m/enemy147.png",
      "sz": [
        51,
        74,
        25,
        74
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy147",
      "tr": 4,
      "hr": 50,
      "vis": 500,
      "lr": [
        0,
        0.05
      ]
    },
    "710": {
      "n": "Kinh Phong Mạc Bắc Thảo Nguyên",
      "img": "img/m/enemy024.png",
      "sz": [
        64,
        82,
        32,
        82
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy024",
      "tr": 4,
      "hr": 50,
      "vis": 500,
      "lr": [
        0,
        0.05
      ]
    },
    "711": {
      "n": "Phục Ba Kim sơn đảo",
      "img": "img/m/enemy205.png",
      "sz": [
        75,
        81,
        37,
        81
      ],
      "ranged": 0,
      "sk": [
        53,
        236,
        53,
        236
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy205",
      "tr": 4,
      "hr": 50,
      "vis": 500,
      "lr": [
        0,
        0.05
      ]
    },
    "712": {
      "n": "Phá Lang Kim sơn đảo",
      "img": "img/m/enemy048.png",
      "sz": [
        38,
        77,
        19,
        77
      ],
      "ranged": 0,
      "sk": [
        53,
        122,
        53,
        122
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy048",
      "tr": 4,
      "hr": 50,
      "vis": 500,
      "lr": [
        0,
        0.05
      ]
    },
    "713": {
      "n": "Thừa Phong Kim sơn đảo",
      "img": "img/m/enemy069.png",
      "sz": [
        35,
        68,
        17,
        68
      ],
      "ranged": 0,
      "sk": [
        53,
        241,
        53,
        241
      ],
      "spd": 18,
      "run": 6,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy069",
      "tr": 4,
      "hr": 50,
      "vis": 500,
      "lr": [
        0,
        0.05
      ]
    },
    "716": {
      "n": "Hạ Hầu Phục",
      "img": "img/m/enemy050.png",
      "sz": [
        62,
        73,
        31,
        73
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy050",
      "tr": 0,
      "hr": 50,
      "vis": 500,
      "lr": [
        30,
        0
      ]
    },
    "717": {
      "n": "Tiếu Vô Thường",
      "img": "img/m/enemy051.png",
      "sz": [
        35,
        75,
        17,
        75
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy051",
      "tr": 0,
      "hr": 50,
      "vis": 500,
      "lr": [
        30,
        0
      ]
    },
    "720": {
      "n": "Lục Phi",
      "img": "img/m/enemy089.png",
      "sz": [
        45,
        80,
        22,
        80
      ],
      "ranged": 0,
      "sk": [
        153,
        153,
        153,
        153
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        95,
        95,
        95,
        95,
        95
      ],
      "anim": "enemy089",
      "tr": 0,
      "hr": 50,
      "vis": 500,
      "lr": [
        30,
        0
      ]
    },
    "851": {
      "n": "Tiểu Boss cấp 20",
      "img": "img/m/enemy107.png",
      "sz": [
        39,
        77,
        19,
        77
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        85,
        85,
        85,
        85,
        85
      ],
      "anim": "enemy107",
      "tr": 8,
      "hr": 100,
      "vis": 800,
      "lr": [
        0,
        20
      ]
    },
    "852": {
      "n": "Tiểu Boss cấp 30",
      "img": "img/m/enemy081.png",
      "sz": [
        30,
        74,
        15,
        74
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        85,
        85,
        85,
        85,
        85
      ],
      "anim": "enemy081",
      "tr": 8,
      "hr": 100,
      "vis": 900,
      "lr": [
        0,
        40
      ]
    },
    "853": {
      "n": "Tiểu Boss cấp 40",
      "img": "img/m/enemy109.png",
      "sz": [
        30,
        77,
        15,
        77
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        85,
        85,
        85,
        85,
        85
      ],
      "anim": "enemy109",
      "tr": 8,
      "hr": 100,
      "vis": 1000,
      "lr": [
        0,
        75
      ]
    },
    "854": {
      "n": "Tiểu Boss cấp 50",
      "img": "img/m/enemy126.png",
      "sz": [
        36,
        80,
        18,
        80
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        85,
        85,
        85,
        85,
        85
      ],
      "anim": "enemy126",
      "tr": 8,
      "hr": 100,
      "vis": 1100,
      "lr": [
        0,
        200
      ]
    },
    "855": {
      "n": "Tiểu Boss cấp 60",
      "img": "img/m/enemy089.png",
      "sz": [
        45,
        80,
        22,
        80
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        85,
        85,
        85,
        85,
        85
      ],
      "anim": "enemy089",
      "tr": 8,
      "hr": 100,
      "vis": 1200,
      "lr": [
        0,
        300
      ]
    },
    "856": {
      "n": "Tiểu Boss cấp 70",
      "img": "img/m/enemy070.png",
      "sz": [
        32,
        66,
        16,
        66
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        85,
        85,
        85,
        85,
        85
      ],
      "anim": "enemy070",
      "tr": 8,
      "hr": 100,
      "vis": 1300,
      "lr": [
        0,
        400
      ]
    },
    "857": {
      "n": "Tiểu Boss cấp 80",
      "img": "img/m/enemy048.png",
      "sz": [
        38,
        77,
        19,
        77
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        85,
        85,
        85,
        85,
        85
      ],
      "anim": "enemy048",
      "tr": 8,
      "hr": 100,
      "vis": 1400,
      "lr": [
        0,
        700
      ]
    },
    "858": {
      "n": "Tiểu Boss cấp 90",
      "img": "img/m/enemy082.png",
      "sz": [
        71,
        75,
        35,
        75
      ],
      "ranged": 0,
      "sk": [
        53,
        53,
        53,
        53
      ],
      "spd": 15,
      "run": 12,
      "rmax": [
        85,
        85,
        85,
        85,
        85
      ],
      "anim": "enemy082",
      "tr": 8,
      "hr": 100,
      "vis": 1500,
      "lr": [
        0,
        1000
      ]
    }
  },
  "anim": {
    "ani001": {
      "st": {
        "f": "ani001_st.webp",
        "n": 12,
        "d": 8,
        "w": 126,
        "h": 91,
        "ax": 63,
        "ay": 66,
        "ms": 130,
        "s": 1
      },
      "run": {
        "f": "ani001_run.webp",
        "n": 8,
        "d": 8,
        "w": 138,
        "h": 97,
        "ax": 69,
        "ay": 68,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "ani001_at.webp",
        "n": 6,
        "d": 8,
        "w": 204,
        "h": 139,
        "ax": 102,
        "ay": 105,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani001_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 140,
        "h": 100,
        "ax": 70,
        "ay": 69,
        "ms": 167,
        "s": 1
      },
      "die": {
        "f": "ani001_die.webp",
        "n": 5,
        "d": 8,
        "w": 178,
        "h": 109,
        "ax": 89,
        "ay": 66,
        "ms": 222,
        "s": 1
      }
    },
    "ani002": {
      "st": {
        "f": "ani002_st.webp",
        "n": 12,
        "d": 8,
        "w": 124,
        "h": 84,
        "ax": 62,
        "ay": 58,
        "ms": 111,
        "s": 1
      },
      "run": {
        "f": "ani002_run.webp",
        "n": 8,
        "d": 8,
        "w": 128,
        "h": 83,
        "ax": 64,
        "ay": 60,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "ani002_at.webp",
        "n": 7,
        "d": 8,
        "w": 156,
        "h": 126,
        "ax": 78,
        "ay": 97,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani002_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 142,
        "h": 83,
        "ax": 71,
        "ay": 58,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "ani002_die.webp",
        "n": 7,
        "d": 8,
        "w": 156,
        "h": 99,
        "ax": 78,
        "ay": 61,
        "ms": 198,
        "s": 1
      }
    },
    "ani003": {
      "st": {
        "f": "ani003_st.webp",
        "n": 12,
        "d": 8,
        "w": 124,
        "h": 84,
        "ax": 62,
        "ay": 58,
        "ms": 111,
        "s": 1
      },
      "run": {
        "f": "ani003_run.webp",
        "n": 8,
        "d": 8,
        "w": 128,
        "h": 83,
        "ax": 64,
        "ay": 60,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "ani003_at.webp",
        "n": 6,
        "d": 8,
        "w": 158,
        "h": 127,
        "ax": 79,
        "ay": 95,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani003_hurt.webp",
        "n": 5,
        "d": 8,
        "w": 148,
        "h": 91,
        "ax": 74,
        "ay": 60,
        "ms": 133,
        "s": 1
      },
      "die": {
        "f": "ani003_die.webp",
        "n": 7,
        "d": 8,
        "w": 166,
        "h": 98,
        "ax": 83,
        "ay": 58,
        "ms": 159,
        "s": 1
      }
    },
    "ani005": {
      "st": {
        "f": "ani005_st.webp",
        "n": 15,
        "d": 8,
        "w": 124,
        "h": 85,
        "ax": 62,
        "ay": 58,
        "ms": 111,
        "s": 1
      },
      "run": {
        "f": "ani005_run.webp",
        "n": 8,
        "d": 8,
        "w": 126,
        "h": 84,
        "ax": 63,
        "ay": 60,
        "ms": 146,
        "s": 1
      },
      "at": {
        "f": "ani005_at.webp",
        "n": 7,
        "d": 8,
        "w": 156,
        "h": 125,
        "ax": 78,
        "ay": 97,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani005_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 140,
        "h": 83,
        "ax": 70,
        "ay": 58,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "ani005_die.webp",
        "n": 7,
        "d": 8,
        "w": 156,
        "h": 98,
        "ax": 78,
        "ay": 61,
        "ms": 238,
        "s": 1
      }
    },
    "ani006": {
      "st": {
        "f": "ani006_st.webp",
        "n": 12,
        "d": 8,
        "w": 118,
        "h": 80,
        "ax": 59,
        "ay": 55,
        "ms": 130,
        "s": 1
      },
      "run": {
        "f": "ani006_run.webp",
        "n": 4,
        "d": 8,
        "w": 160,
        "h": 98,
        "ax": 80,
        "ay": 74,
        "ms": 194,
        "s": 1
      },
      "at": {
        "f": "ani006_at.webp",
        "n": 6,
        "d": 8,
        "w": 136,
        "h": 93,
        "ax": 68,
        "ay": 68,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani006_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 124,
        "h": 83,
        "ax": 62,
        "ay": 54,
        "ms": 194,
        "s": 1
      },
      "die": {
        "f": "ani006_die.webp",
        "n": 7,
        "d": 8,
        "w": 148,
        "h": 93,
        "ax": 74,
        "ay": 57,
        "ms": 246,
        "s": 1
      }
    },
    "ani009": {
      "st": {
        "f": "ani009_st.webp",
        "n": 6,
        "d": 8,
        "w": 82,
        "h": 71,
        "ax": 41,
        "ay": 75,
        "ms": 139,
        "s": 1
      },
      "run": {
        "f": "ani009_run.webp",
        "n": 8,
        "d": 8,
        "w": 88,
        "h": 76,
        "ax": 44,
        "ay": 79,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "ani009_at.webp",
        "n": 7,
        "d": 8,
        "w": 122,
        "h": 92,
        "ax": 61,
        "ay": 95,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani009_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 120,
        "h": 76,
        "ax": 60,
        "ay": 77,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "ani009_die.webp",
        "n": 5,
        "d": 8,
        "w": 122,
        "h": 84,
        "ax": 61,
        "ay": 75,
        "ms": 289,
        "s": 1
      }
    },
    "ani010": {
      "st": {
        "f": "ani010_st.webp",
        "n": 6,
        "d": 8,
        "w": 80,
        "h": 69,
        "ax": 40,
        "ay": 74,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "ani010_run.webp",
        "n": 8,
        "d": 8,
        "w": 86,
        "h": 74,
        "ax": 43,
        "ay": 78,
        "ms": 83,
        "s": 1
      },
      "at": {
        "f": "ani010_at.webp",
        "n": 7,
        "d": 8,
        "w": 118,
        "h": 89,
        "ax": 59,
        "ay": 93,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani010_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 118,
        "h": 74,
        "ax": 59,
        "ay": 76,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "ani010_die.webp",
        "n": 5,
        "d": 8,
        "w": 120,
        "h": 83,
        "ax": 60,
        "ay": 74,
        "ms": 289,
        "s": 1
      }
    },
    "ani011": {
      "st": {
        "f": "ani011_st.webp",
        "n": 6,
        "d": 8,
        "w": 72,
        "h": 64,
        "ax": 36,
        "ay": 71,
        "ms": 93,
        "s": 1
      },
      "run": {
        "f": "ani011_run.webp",
        "n": 8,
        "d": 8,
        "w": 78,
        "h": 67,
        "ax": 39,
        "ay": 74,
        "ms": 83,
        "s": 1
      },
      "at": {
        "f": "ani011_at.webp",
        "n": 7,
        "d": 8,
        "w": 108,
        "h": 82,
        "ax": 54,
        "ay": 88,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani011_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 108,
        "h": 67,
        "ax": 54,
        "ay": 72,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "ani011_die.webp",
        "n": 5,
        "d": 8,
        "w": 110,
        "h": 75,
        "ax": 55,
        "ay": 70,
        "ms": 222,
        "s": 1
      }
    },
    "ani012": {
      "st": {
        "f": "ani012_st.webp",
        "n": 6,
        "d": 8,
        "w": 78,
        "h": 67,
        "ax": 39,
        "ay": 73,
        "ms": 111,
        "s": 1
      },
      "run": {
        "f": "ani012_run.webp",
        "n": 8,
        "d": 8,
        "w": 84,
        "h": 72,
        "ax": 42,
        "ay": 77,
        "ms": 104,
        "s": 1
      },
      "at": {
        "f": "ani012_at.webp",
        "n": 7,
        "d": 8,
        "w": 116,
        "h": 88,
        "ax": 58,
        "ay": 92,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani012_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 115,
        "h": 73,
        "ax": 58,
        "ay": 75,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "ani012_die.webp",
        "n": 5,
        "d": 8,
        "w": 118,
        "h": 81,
        "ax": 59,
        "ay": 73,
        "ms": 178,
        "s": 1
      }
    },
    "ani013": {
      "st": {
        "f": "ani013_st.webp",
        "n": 8,
        "d": 8,
        "w": 98,
        "h": 55,
        "ax": 49,
        "ay": 34,
        "ms": 97,
        "s": 1
      },
      "run": {
        "f": "ani013_run.webp",
        "n": 8,
        "d": 8,
        "w": 102,
        "h": 60,
        "ax": 51,
        "ay": 45,
        "ms": 146,
        "s": 1
      },
      "at": {
        "f": "ani013_at.webp",
        "n": 7,
        "d": 8,
        "w": 96,
        "h": 85,
        "ax": 48,
        "ay": 64,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani013_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 96,
        "h": 53,
        "ax": 48,
        "ay": 34,
        "ms": 167,
        "s": 1
      },
      "die": {
        "f": "ani013_die.webp",
        "n": 5,
        "d": 8,
        "w": 104,
        "h": 61,
        "ax": 52,
        "ay": 42,
        "ms": 156,
        "s": 1
      }
    },
    "ani015": {
      "st": {
        "f": "ani015_st.webp",
        "n": 8,
        "d": 8,
        "w": 114,
        "h": 69,
        "ax": 57,
        "ay": 46,
        "ms": 83,
        "s": 1
      },
      "run": {
        "f": "ani015_run.webp",
        "n": 8,
        "d": 8,
        "w": 120,
        "h": 71,
        "ax": 60,
        "ay": 55,
        "ms": 153,
        "s": 1
      },
      "at": {
        "f": "ani015_at.webp",
        "n": 7,
        "d": 8,
        "w": 112,
        "h": 104,
        "ax": 56,
        "ay": 80,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani015_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 112,
        "h": 67,
        "ax": 56,
        "ay": 46,
        "ms": 167,
        "s": 1
      },
      "die": {
        "f": "ani015_die.webp",
        "n": 5,
        "d": 8,
        "w": 124,
        "h": 72,
        "ax": 62,
        "ay": 51,
        "ms": 156,
        "s": 1
      }
    },
    "ani018": {
      "st": {
        "f": "ani018_st.webp",
        "n": 6,
        "d": 8,
        "w": 90,
        "h": 71,
        "ax": 45,
        "ay": 66,
        "ms": 93,
        "s": 1
      },
      "run": {
        "f": "ani018_run.webp",
        "n": 8,
        "d": 8,
        "w": 98,
        "h": 77,
        "ax": 49,
        "ay": 70,
        "ms": 153,
        "s": 1
      },
      "at": {
        "f": "ani018_at.webp",
        "n": 7,
        "d": 8,
        "w": 132,
        "h": 87,
        "ax": 66,
        "ay": 70,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani018_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 118,
        "h": 81,
        "ax": 59,
        "ay": 71,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "ani018_die.webp",
        "n": 6,
        "d": 8,
        "w": 113,
        "h": 86,
        "ax": 57,
        "ay": 68,
        "ms": 278,
        "s": 1
      }
    },
    "ani019": {
      "st": {
        "f": "ani019_st.webp",
        "n": 6,
        "d": 8,
        "w": 78,
        "h": 60,
        "ax": 39,
        "ay": 42,
        "ms": 130,
        "s": 1
      },
      "run": {
        "f": "ani019_run.webp",
        "n": 4,
        "d": 8,
        "w": 78,
        "h": 62,
        "ax": 39,
        "ay": 45,
        "ms": 278,
        "s": 1
      },
      "at": {
        "f": "ani019_at.webp",
        "n": 6,
        "d": 8,
        "w": 80,
        "h": 77,
        "ax": 40,
        "ay": 56,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani019_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 88,
        "h": 79,
        "ax": 44,
        "ay": 55,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "ani019_die.webp",
        "n": 4,
        "d": 8,
        "w": 150,
        "h": 106,
        "ax": 75,
        "ay": 75,
        "ms": 236,
        "s": 1
      }
    },
    "ani021": {
      "st": {
        "f": "ani021_st.webp",
        "n": 14,
        "d": 8,
        "w": 231,
        "h": 160,
        "ax": 116,
        "ay": 123,
        "ms": 151,
        "s": 1
      },
      "run": {
        "f": "ani021_run.webp",
        "n": 7,
        "d": 8,
        "w": 218,
        "h": 165,
        "ax": 109,
        "ay": 124,
        "ms": 190,
        "s": 1
      },
      "at": {
        "f": "ani021_at.webp",
        "n": 7,
        "d": 8,
        "w": 263,
        "h": 211,
        "ax": 131,
        "ay": 174,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani021_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 217,
        "h": 161,
        "ax": 108,
        "ay": 124,
        "ms": 296,
        "s": 1
      },
      "die": {
        "f": "ani021_die.webp",
        "n": 7,
        "d": 8,
        "w": 250,
        "h": 168,
        "ax": 125,
        "ay": 123,
        "ms": 302,
        "s": 1
      }
    },
    "ani024": {
      "st": {
        "f": "ani024_st.webp",
        "n": 14,
        "d": 8,
        "w": 231,
        "h": 160,
        "ax": 116,
        "ay": 123,
        "ms": 151,
        "s": 1
      },
      "run": {
        "f": "ani024_run.webp",
        "n": 7,
        "d": 8,
        "w": 218,
        "h": 165,
        "ax": 109,
        "ay": 124,
        "ms": 190,
        "s": 1
      },
      "at": {
        "f": "ani024_at.webp",
        "n": 7,
        "d": 8,
        "w": 263,
        "h": 211,
        "ax": 131,
        "ay": 174,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani024_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 217,
        "h": 161,
        "ax": 108,
        "ay": 124,
        "ms": 296,
        "s": 1
      },
      "die": {
        "f": "ani024_die.webp",
        "n": 7,
        "d": 8,
        "w": 250,
        "h": 168,
        "ax": 125,
        "ay": 123,
        "ms": 302,
        "s": 1
      }
    },
    "ani025": {
      "st": {
        "f": "ani025_st.webp",
        "n": 6,
        "d": 8,
        "w": 122,
        "h": 78,
        "ax": 61,
        "ay": 61,
        "ms": 130,
        "s": 1
      },
      "run": {
        "f": "ani025_run.webp",
        "n": 8,
        "d": 8,
        "w": 124,
        "h": 84,
        "ax": 62,
        "ay": 66,
        "ms": 188,
        "s": 1
      },
      "at": {
        "f": "ani025_at.webp",
        "n": 6,
        "d": 8,
        "w": 164,
        "h": 125,
        "ax": 82,
        "ay": 98,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani025_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 122,
        "h": 78,
        "ax": 61,
        "ay": 61,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "ani025_die.webp",
        "n": 6,
        "d": 8,
        "w": 120,
        "h": 84,
        "ax": 60,
        "ay": 57,
        "ms": 287,
        "s": 1
      }
    },
    "ani026": {
      "st": {
        "f": "ani026_st.webp",
        "n": 6,
        "d": 8,
        "w": 118,
        "h": 78,
        "ax": 59,
        "ay": 60,
        "ms": 130,
        "s": 1
      },
      "run": {
        "f": "ani026_run.webp",
        "n": 8,
        "d": 8,
        "w": 122,
        "h": 83,
        "ax": 61,
        "ay": 65,
        "ms": 146,
        "s": 1
      },
      "at": {
        "f": "ani026_at.webp",
        "n": 6,
        "d": 8,
        "w": 164,
        "h": 125,
        "ax": 82,
        "ay": 98,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani026_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 116,
        "h": 78,
        "ax": 58,
        "ay": 60,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "ani026_die.webp",
        "n": 6,
        "d": 8,
        "w": 118,
        "h": 84,
        "ax": 59,
        "ay": 57,
        "ms": 241,
        "s": 1
      }
    },
    "ani029": {
      "st": {
        "f": "ani029_st.webp",
        "n": 6,
        "d": 8,
        "w": 144,
        "h": 117,
        "ax": 72,
        "ay": 91,
        "ms": 278,
        "s": 1
      },
      "run": {
        "f": "ani029_run.webp",
        "n": 7,
        "d": 8,
        "w": 137,
        "h": 120,
        "ax": 69,
        "ay": 91,
        "ms": 183,
        "s": 1
      },
      "at": {
        "f": "ani029_at.webp",
        "n": 7,
        "d": 8,
        "w": 204,
        "h": 133,
        "ax": 102,
        "ay": 91,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani029_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 142,
        "h": 119,
        "ax": 71,
        "ay": 93,
        "ms": 278,
        "s": 1
      },
      "die": {
        "f": "ani029_die.webp",
        "n": 7,
        "d": 8,
        "w": 163,
        "h": 134,
        "ax": 81,
        "ay": 90,
        "ms": 286,
        "s": 1
      }
    },
    "ani033": {
      "st": {
        "f": "ani033_st.webp",
        "n": 12,
        "d": 8,
        "w": 192,
        "h": 97,
        "ax": 96,
        "ay": 51,
        "ms": 139,
        "s": 1
      },
      "run": {
        "f": "ani033_run.webp",
        "n": 5,
        "d": 8,
        "w": 190,
        "h": 95,
        "ax": 95,
        "ay": 49,
        "ms": 289,
        "s": 1
      },
      "at": {
        "f": "ani033_at.webp",
        "n": 7,
        "d": 8,
        "w": 194,
        "h": 126,
        "ax": 97,
        "ay": 78,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani033_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 198,
        "h": 98,
        "ax": 99,
        "ay": 50,
        "ms": 278,
        "s": 1
      },
      "die": {
        "f": "ani033_die.webp",
        "n": 6,
        "d": 8,
        "w": 194,
        "h": 134,
        "ax": 97,
        "ay": 87,
        "ms": 278,
        "s": 1
      }
    },
    "ani036": {
      "st": {
        "f": "ani036_st.webp",
        "n": 12,
        "d": 8,
        "w": 192,
        "h": 97,
        "ax": 96,
        "ay": 51,
        "ms": 148,
        "s": 1
      },
      "run": {
        "f": "ani036_run.webp",
        "n": 5,
        "d": 8,
        "w": 190,
        "h": 95,
        "ax": 95,
        "ay": 49,
        "ms": 267,
        "s": 1
      },
      "at": {
        "f": "ani036_at.webp",
        "n": 7,
        "d": 8,
        "w": 194,
        "h": 126,
        "ax": 97,
        "ay": 78,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani036_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 198,
        "h": 98,
        "ax": 99,
        "ay": 50,
        "ms": 278,
        "s": 1
      },
      "die": {
        "f": "ani036_die.webp",
        "n": 6,
        "d": 8,
        "w": 194,
        "h": 134,
        "ax": 97,
        "ay": 87,
        "ms": 296,
        "s": 1
      }
    },
    "ani037": {
      "st": {
        "f": "ani037_st.webp",
        "n": 10,
        "d": 8,
        "w": 100,
        "h": 69,
        "ax": 50,
        "ay": 43,
        "ms": 150,
        "s": 1
      },
      "run": {
        "f": "ani037_run.webp",
        "n": 7,
        "d": 8,
        "w": 186,
        "h": 90,
        "ax": 93,
        "ay": 44,
        "ms": 87,
        "s": 1
      },
      "at": {
        "f": "ani037_at.webp",
        "n": 7,
        "d": 8,
        "w": 102,
        "h": 81,
        "ax": 51,
        "ay": 55,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani037_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 100,
        "h": 68,
        "ax": 50,
        "ay": 42,
        "ms": 208,
        "s": 1
      },
      "die": {
        "f": "ani037_die.webp",
        "n": 6,
        "d": 8,
        "w": 100,
        "h": 79,
        "ax": 50,
        "ay": 53,
        "ms": 222,
        "s": 1
      }
    },
    "ani038": {
      "st": {
        "f": "ani038_st.webp",
        "n": 13,
        "d": 8,
        "w": 144,
        "h": 83,
        "ax": 72,
        "ay": 40,
        "ms": 56,
        "s": 1
      },
      "run": {
        "f": "ani038_run.webp",
        "n": 7,
        "d": 8,
        "w": 196,
        "h": 106,
        "ax": 98,
        "ay": 54,
        "ms": 159,
        "s": 1
      },
      "at": {
        "f": "ani038_at.webp",
        "n": 7,
        "d": 8,
        "w": 192,
        "h": 123,
        "ax": 96,
        "ay": 76,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani038_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 144,
        "h": 89,
        "ax": 72,
        "ay": 49,
        "ms": 83,
        "s": 1
      },
      "die": {
        "f": "ani038_die.webp",
        "n": 6,
        "d": 8,
        "w": 144,
        "h": 102,
        "ax": 72,
        "ay": 62,
        "ms": 176,
        "s": 1
      }
    },
    "ani039": {
      "st": {
        "f": "ani039_st.webp",
        "n": 13,
        "d": 8,
        "w": 100,
        "h": 55,
        "ax": 50,
        "ay": 28,
        "ms": 150,
        "s": 1
      },
      "run": {
        "f": "ani039_run.webp",
        "n": 7,
        "d": 8,
        "w": 136,
        "h": 73,
        "ax": 68,
        "ay": 39,
        "ms": 175,
        "s": 1
      },
      "at": {
        "f": "ani039_at.webp",
        "n": 7,
        "d": 8,
        "w": 126,
        "h": 82,
        "ax": 63,
        "ay": 50,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani039_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 100,
        "h": 60,
        "ax": 50,
        "ay": 34,
        "ms": 194,
        "s": 1
      },
      "die": {
        "f": "ani039_die.webp",
        "n": 6,
        "d": 8,
        "w": 100,
        "h": 68,
        "ax": 50,
        "ay": 42,
        "ms": 241,
        "s": 1
      }
    },
    "ani040": {
      "st": {
        "f": "ani040_st.webp",
        "n": 10,
        "d": 8,
        "w": 146,
        "h": 100,
        "ax": 73,
        "ay": 48,
        "ms": 83,
        "s": 1
      },
      "run": {
        "f": "ani040_run.webp",
        "n": 7,
        "d": 8,
        "w": 272,
        "h": 132,
        "ax": 136,
        "ay": 50,
        "ms": 159,
        "s": 1
      },
      "at": {
        "f": "ani040_at.webp",
        "n": 7,
        "d": 8,
        "w": 149,
        "h": 117,
        "ax": 74,
        "ay": 65,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani040_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 147,
        "h": 99,
        "ax": 73,
        "ay": 47,
        "ms": 97,
        "s": 1
      },
      "die": {
        "f": "ani040_die.webp",
        "n": 6,
        "d": 8,
        "w": 149,
        "h": 114,
        "ax": 73,
        "ay": 62,
        "ms": 130,
        "s": 1
      }
    },
    "ani041": {
      "st": {
        "f": "ani041_st.webp",
        "n": 12,
        "d": 8,
        "w": 82,
        "h": 48,
        "ax": 41,
        "ay": 132,
        "ms": 42,
        "s": 1
      },
      "run": {
        "f": "ani041_run.webp",
        "n": 4,
        "d": 8,
        "w": 82,
        "h": 54,
        "ax": 41,
        "ay": 140,
        "ms": 56,
        "s": 1
      },
      "at": {
        "f": "ani041_at.webp",
        "n": 7,
        "d": 8,
        "w": 94,
        "h": 104,
        "ax": 47,
        "ay": 155,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani041_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 96,
        "h": 75,
        "ax": 48,
        "ay": 155,
        "ms": 97,
        "s": 1
      },
      "die": {
        "f": "ani041_die.webp",
        "n": 7,
        "d": 8,
        "w": 100,
        "h": 210,
        "ax": 50,
        "ay": 164,
        "ms": 119,
        "s": 1
      }
    },
    "ani042": {
      "st": {
        "f": "ani042_st.webp",
        "n": 12,
        "d": 8,
        "w": 74,
        "h": 50,
        "ax": 37,
        "ay": 103,
        "ms": 93,
        "s": 1
      },
      "run": {
        "f": "ani042_run.webp",
        "n": 6,
        "d": 8,
        "w": 72,
        "h": 48,
        "ax": 36,
        "ay": 111,
        "ms": 93,
        "s": 1
      },
      "at": {
        "f": "ani042_at.webp",
        "n": 4,
        "d": 8,
        "w": 76,
        "h": 54,
        "ax": 38,
        "ay": 108,
        "ms": 278,
        "s": 1
      },
      "hurt": {
        "f": "ani042_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 72,
        "h": 66,
        "ax": 36,
        "ay": 118,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "ani042_die.webp",
        "n": 7,
        "d": 8,
        "w": 76,
        "h": 128,
        "ax": 38,
        "ay": 125,
        "ms": 190,
        "s": 1
      }
    },
    "ani043": {
      "st": {
        "f": "ani043_st.webp",
        "n": 12,
        "d": 8,
        "w": 79,
        "h": 60,
        "ax": 40,
        "ay": 117,
        "ms": 56,
        "s": 1
      },
      "run": {
        "f": "ani043_run.webp",
        "n": 6,
        "d": 8,
        "w": 80,
        "h": 55,
        "ax": 40,
        "ay": 109,
        "ms": 83,
        "s": 1
      },
      "at": {
        "f": "ani043_at.webp",
        "n": 4,
        "d": 8,
        "w": 84,
        "h": 57,
        "ax": 42,
        "ay": 115,
        "ms": 278,
        "s": 1
      },
      "hurt": {
        "f": "ani043_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 87,
        "h": 56,
        "ax": 43,
        "ay": 116,
        "ms": 111,
        "s": 1
      },
      "die": {
        "f": "ani043_die.webp",
        "n": 7,
        "d": 8,
        "w": 88,
        "h": 149,
        "ax": 44,
        "ay": 129,
        "ms": 127,
        "s": 1
      }
    },
    "ani045": {
      "st": {
        "f": "ani045_st.webp",
        "n": 10,
        "d": 8,
        "w": 42,
        "h": 36,
        "ax": 21,
        "ay": 91,
        "ms": 67,
        "s": 1
      },
      "run": {
        "f": "ani045_run.webp",
        "n": 5,
        "d": 8,
        "w": 46,
        "h": 38,
        "ax": 23,
        "ay": 89,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "ani045_at.webp",
        "n": 6,
        "d": 8,
        "w": 58,
        "h": 47,
        "ax": 29,
        "ay": 91,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani045_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 54,
        "h": 42,
        "ax": 27,
        "ay": 89,
        "ms": 333,
        "s": 1
      },
      "die": {
        "f": "ani045_die.webp",
        "n": 6,
        "d": 8,
        "w": 40,
        "h": 101,
        "ax": 20,
        "ay": 88,
        "ms": 259,
        "s": 1
      }
    },
    "ani046": {
      "st": {
        "f": "ani046_st.webp",
        "n": 10,
        "d": 8,
        "w": 40,
        "h": 35,
        "ax": 20,
        "ay": 89,
        "ms": 78,
        "s": 1
      },
      "run": {
        "f": "ani046_run.webp",
        "n": 5,
        "d": 8,
        "w": 46,
        "h": 36,
        "ax": 23,
        "ay": 87,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "ani046_at.webp",
        "n": 6,
        "d": 8,
        "w": 58,
        "h": 47,
        "ax": 29,
        "ay": 90,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani046_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 54,
        "h": 41,
        "ax": 27,
        "ay": 88,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "ani046_die.webp",
        "n": 6,
        "d": 8,
        "w": 40,
        "h": 99,
        "ax": 20,
        "ay": 87,
        "ms": 259,
        "s": 1
      }
    },
    "ani047": {
      "st": {
        "f": "ani047_st.webp",
        "n": 10,
        "d": 8,
        "w": 48,
        "h": 41,
        "ax": 24,
        "ay": 99,
        "ms": 78,
        "s": 1
      },
      "run": {
        "f": "ani047_run.webp",
        "n": 5,
        "d": 8,
        "w": 52,
        "h": 43,
        "ax": 26,
        "ay": 97,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "ani047_at.webp",
        "n": 6,
        "d": 8,
        "w": 67,
        "h": 55,
        "ax": 34,
        "ay": 100,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani047_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 62,
        "h": 48,
        "ax": 31,
        "ay": 97,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "ani047_die.webp",
        "n": 6,
        "d": 8,
        "w": 46,
        "h": 115,
        "ax": 23,
        "ay": 96,
        "ms": 259,
        "s": 1
      }
    },
    "ani048": {
      "st": {
        "f": "ani048_st.webp",
        "n": 10,
        "d": 8,
        "w": 36,
        "h": 31,
        "ax": 18,
        "ay": 83,
        "ms": 78,
        "s": 1
      },
      "run": {
        "f": "ani048_run.webp",
        "n": 5,
        "d": 8,
        "w": 40,
        "h": 33,
        "ax": 20,
        "ay": 82,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "ani048_at.webp",
        "n": 6,
        "d": 8,
        "w": 52,
        "h": 42,
        "ax": 26,
        "ay": 84,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani048_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 48,
        "h": 37,
        "ax": 24,
        "ay": 82,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "ani048_die.webp",
        "n": 6,
        "d": 8,
        "w": 36,
        "h": 88,
        "ax": 18,
        "ay": 81,
        "ms": 259,
        "s": 1
      }
    },
    "ani049": {
      "st": {
        "f": "ani049_st.webp",
        "n": 8,
        "d": 8,
        "w": 44,
        "h": 42,
        "ax": 22,
        "ay": 33,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "ani049_run.webp",
        "n": 6,
        "d": 8,
        "w": 77,
        "h": 48,
        "ax": 35,
        "ay": 30,
        "ms": 204,
        "s": 1
      },
      "at": {
        "f": "ani049_at.webp",
        "n": 5,
        "d": 8,
        "w": 70,
        "h": 62,
        "ax": 35,
        "ay": 48,
        "ms": 222,
        "s": 1
      },
      "hurt": {
        "f": "ani049_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 52,
        "h": 46,
        "ax": 26,
        "ay": 38,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "ani049_die.webp",
        "n": 6,
        "d": 8,
        "w": 80,
        "h": 45,
        "ax": 40,
        "ay": 32,
        "ms": 222,
        "s": 1
      }
    },
    "ani051": {
      "st": {
        "f": "ani051_st.webp",
        "n": 8,
        "d": 8,
        "w": 64,
        "h": 45,
        "ax": 33,
        "ay": 26,
        "ms": 76,
        "s": 1
      },
      "run": {
        "f": "ani051_run.webp",
        "n": 5,
        "d": 8,
        "w": 82,
        "h": 55,
        "ax": 42,
        "ay": 35,
        "ms": 89,
        "s": 1
      },
      "at": {
        "f": "ani051_at.webp",
        "n": 6,
        "d": 8,
        "w": 82,
        "h": 63,
        "ax": 42,
        "ay": 44,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani051_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 80,
        "h": 49,
        "ax": 41,
        "ay": 31,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "ani051_die.webp",
        "n": 7,
        "d": 8,
        "w": 92,
        "h": 56,
        "ax": 47,
        "ay": 36,
        "ms": 222,
        "s": 1
      }
    },
    "ani052": {
      "st": {
        "f": "ani052_st.webp",
        "n": 8,
        "d": 8,
        "w": 78,
        "h": 49,
        "ax": 39,
        "ay": 40,
        "ms": 97,
        "s": 1
      },
      "run": {
        "f": "ani052_run.webp",
        "n": 5,
        "d": 8,
        "w": 78,
        "h": 49,
        "ax": 39,
        "ay": 37,
        "ms": 89,
        "s": 1
      },
      "at": {
        "f": "ani052_at.webp",
        "n": 5,
        "d": 8,
        "w": 98,
        "h": 78,
        "ax": 49,
        "ay": 62,
        "ms": 222,
        "s": 1
      },
      "hurt": {
        "f": "ani052_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 80,
        "h": 54,
        "ax": 40,
        "ay": 45,
        "ms": 167,
        "s": 1
      },
      "die": {
        "f": "ani052_die.webp",
        "n": 7,
        "d": 8,
        "w": 76,
        "h": 55,
        "ax": 38,
        "ay": 40,
        "ms": 175,
        "s": 1
      }
    },
    "ani053": {
      "st": {
        "f": "ani053_st.webp",
        "n": 15,
        "d": 8,
        "w": 38,
        "h": 43,
        "ax": 19,
        "ay": 36,
        "ms": 111,
        "s": 1
      },
      "run": {
        "f": "ani053_run.webp",
        "n": 7,
        "d": 8,
        "w": 76,
        "h": 59,
        "ax": 38,
        "ay": 40,
        "ms": 167,
        "s": 1
      },
      "at": {
        "f": "ani053_at.webp",
        "n": 7,
        "d": 8,
        "w": 76,
        "h": 69,
        "ax": 38,
        "ay": 59,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani053_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 44,
        "h": 48,
        "ax": 22,
        "ay": 40,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "ani053_die.webp",
        "n": 7,
        "d": 8,
        "w": 72,
        "h": 69,
        "ax": 36,
        "ay": 50,
        "ms": 183,
        "s": 1
      }
    },
    "ani054": {
      "st": {
        "f": "ani054_st.webp",
        "n": 15,
        "d": 8,
        "w": 66,
        "h": 49,
        "ax": 33,
        "ay": 33,
        "ms": 133,
        "s": 1
      },
      "run": {
        "f": "ani054_run.webp",
        "n": 7,
        "d": 8,
        "w": 76,
        "h": 58,
        "ax": 38,
        "ay": 39,
        "ms": 151,
        "s": 1
      },
      "at": {
        "f": "ani054_at.webp",
        "n": 8,
        "d": 8,
        "w": 76,
        "h": 87,
        "ax": 38,
        "ay": 69,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "ani054_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 72,
        "h": 49,
        "ax": 36,
        "ay": 33,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "ani054_die.webp",
        "n": 7,
        "d": 8,
        "w": 136,
        "h": 84,
        "ax": 68,
        "ay": 52,
        "ms": 222,
        "s": 1
      }
    },
    "ani055": {
      "st": {
        "f": "ani055_st.webp",
        "n": 15,
        "d": 8,
        "w": 66,
        "h": 52,
        "ax": 33,
        "ay": 36,
        "ms": 111,
        "s": 1
      },
      "run": {
        "f": "ani055_run.webp",
        "n": 7,
        "d": 8,
        "w": 76,
        "h": 59,
        "ax": 38,
        "ay": 40,
        "ms": 167,
        "s": 1
      },
      "at": {
        "f": "ani055_at.webp",
        "n": 11,
        "d": 8,
        "w": 78,
        "h": 74,
        "ax": 39,
        "ay": 58,
        "ms": 101,
        "s": 1
      },
      "hurt": {
        "f": "ani055_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 72,
        "h": 52,
        "ax": 36,
        "ay": 36,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "ani055_die.webp",
        "n": 6,
        "d": 8,
        "w": 124,
        "h": 80,
        "ax": 62,
        "ay": 48,
        "ms": 204,
        "s": 1
      }
    },
    "ani058": {
      "st": {
        "f": "ani058_st.webp",
        "n": 8,
        "d": 8,
        "w": 110,
        "h": 78,
        "ax": 46,
        "ay": 59,
        "ms": 222,
        "s": 1
      },
      "run": {
        "f": "ani058_run.webp",
        "n": 7,
        "d": 8,
        "w": 89,
        "h": 71,
        "ax": 36,
        "ay": 53,
        "ms": 175,
        "s": 1
      },
      "at": {
        "f": "ani058_at.webp",
        "n": 6,
        "d": 8,
        "w": 115,
        "h": 80,
        "ax": 48,
        "ay": 61,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani058_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 107,
        "h": 76,
        "ax": 44,
        "ay": 58,
        "ms": 194,
        "s": 1
      },
      "die": {
        "f": "ani058_die.webp",
        "n": 6,
        "d": 8,
        "w": 122,
        "h": 87,
        "ax": 59,
        "ay": 58,
        "ms": 333,
        "s": 1
      }
    },
    "ani059": {
      "st": {
        "f": "ani059_st.webp",
        "n": 10,
        "d": 8,
        "w": 46,
        "h": 76,
        "ax": 23,
        "ay": 67,
        "ms": 156,
        "s": 1
      },
      "run": {
        "f": "ani059_run.webp",
        "n": 8,
        "d": 8,
        "w": 62,
        "h": 77,
        "ax": 31,
        "ay": 68,
        "ms": 188,
        "s": 1
      },
      "at": {
        "f": "ani059_at.webp",
        "n": 5,
        "d": 8,
        "w": 88,
        "h": 77,
        "ax": 44,
        "ay": 68,
        "ms": 222,
        "s": 1
      },
      "hurt": {
        "f": "ani059_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 75,
        "h": 76,
        "ax": 38,
        "ay": 67,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "ani059_die.webp",
        "n": 7,
        "d": 8,
        "w": 132,
        "h": 97,
        "ax": 66,
        "ay": 67,
        "ms": 222,
        "s": 1
      }
    },
    "ani060": {
      "st": {
        "f": "ani060_st.webp",
        "n": 12,
        "d": 8,
        "w": 26,
        "h": 28,
        "ax": 13,
        "ay": 42,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "ani060_run.webp",
        "n": 6,
        "d": 8,
        "w": 54,
        "h": 51,
        "ax": 27,
        "ay": 63,
        "ms": 222,
        "s": 1
      },
      "at": {
        "f": "ani060_at.webp",
        "n": 6,
        "d": 8,
        "w": 96,
        "h": 58,
        "ax": 48,
        "ay": 70,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani060_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 34,
        "h": 29,
        "ax": 17,
        "ay": 43,
        "ms": 167,
        "s": 1
      },
      "die": {
        "f": "ani060_die.webp",
        "n": 7,
        "d": 8,
        "w": 60,
        "h": 37,
        "ax": 30,
        "ay": 42,
        "ms": 206,
        "s": 1
      }
    },
    "ani061": {
      "st": {
        "f": "ani061_st.webp",
        "n": 14,
        "d": 8,
        "w": 66,
        "h": 74,
        "ax": 33,
        "ay": 60,
        "ms": 139,
        "s": 1
      },
      "run": {
        "f": "ani061_run.webp",
        "n": 6,
        "d": 8,
        "w": 68,
        "h": 76,
        "ax": 34,
        "ay": 61,
        "ms": 204,
        "s": 1
      },
      "at": {
        "f": "ani061_at.webp",
        "n": 7,
        "d": 8,
        "w": 110,
        "h": 95,
        "ax": 55,
        "ay": 71,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "ani061_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 72,
        "h": 74,
        "ax": 36,
        "ay": 60,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "ani061_die.webp",
        "n": 7,
        "d": 8,
        "w": 132,
        "h": 92,
        "ax": 66,
        "ay": 62,
        "ms": 246,
        "s": 1
      }
    },
    "ani063": {
      "st": {
        "f": "ani063_st.webp",
        "n": 15,
        "d": 8,
        "w": 75,
        "h": 57,
        "ax": 33,
        "ay": 40,
        "ms": 115,
        "s": 1
      },
      "run": {
        "f": "ani063_run.webp",
        "n": 4,
        "d": 8,
        "w": 78,
        "h": 57,
        "ax": 35,
        "ay": 40,
        "ms": 278,
        "s": 1
      },
      "at": {
        "f": "ani063_at.webp",
        "n": 8,
        "d": 8,
        "w": 107,
        "h": 70,
        "ax": 47,
        "ay": 47,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "ani063_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 77,
        "h": 56,
        "ax": 33,
        "ay": 40,
        "ms": 181,
        "s": 1
      },
      "die": {
        "f": "ani063_die.webp",
        "n": 8,
        "d": 8,
        "w": 86,
        "h": 62,
        "ax": 41,
        "ay": 40,
        "ms": 215,
        "s": 1
      }
    },
    "ani065": {
      "st": {
        "f": "ani065_st.webp",
        "n": 6,
        "d": 8,
        "w": 58,
        "h": 51,
        "ax": 29,
        "ay": 37,
        "ms": 194,
        "s": 1
      },
      "run": {
        "f": "ani065_run.webp",
        "n": 4,
        "d": 8,
        "w": 60,
        "h": 53,
        "ax": 30,
        "ay": 38,
        "ms": 292,
        "s": 1
      },
      "at": {
        "f": "ani065_at.webp",
        "n": 4,
        "d": 8,
        "w": 92,
        "h": 66,
        "ax": 46,
        "ay": 50,
        "ms": 278,
        "s": 1
      },
      "hurt": {
        "f": "ani065_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 80,
        "h": 65,
        "ax": 40,
        "ay": 49,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "ani065_die.webp",
        "n": 4,
        "d": 8,
        "w": 80,
        "h": 66,
        "ax": 40,
        "ay": 49,
        "ms": 333,
        "s": 1
      }
    },
    "ani066": {
      "st": {
        "f": "ani066_st.webp",
        "n": 10,
        "d": 8,
        "w": 85,
        "h": 61,
        "ax": 42,
        "ay": 62,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "ani066_run.webp",
        "n": 4,
        "d": 8,
        "w": 90,
        "h": 62,
        "ax": 45,
        "ay": 61,
        "ms": 83,
        "s": 1
      },
      "at": {
        "f": "ani066_at.webp",
        "n": 5,
        "d": 8,
        "w": 110,
        "h": 77,
        "ax": 55,
        "ay": 77,
        "ms": 222,
        "s": 1
      },
      "hurt": {
        "f": "ani066_hurt.webp",
        "n": 2,
        "d": 8,
        "w": 90,
        "h": 64,
        "ax": 45,
        "ay": 65,
        "ms": 333,
        "s": 1
      },
      "die": {
        "f": "ani066_die.webp",
        "n": 5,
        "d": 8,
        "w": 120,
        "h": 74,
        "ax": 60,
        "ay": 67,
        "ms": 333,
        "s": 1
      }
    },
    "ani067": {
      "st": {
        "f": "ani067_st.webp",
        "n": 6,
        "d": 8,
        "w": 128,
        "h": 63,
        "ax": 64,
        "ay": 30,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "ani067_run.webp",
        "n": 3,
        "d": 8,
        "w": 128,
        "h": 63,
        "ax": 64,
        "ay": 30,
        "ms": 222,
        "s": 1
      },
      "at": {
        "f": "ani067_at.webp",
        "n": 6,
        "d": 8,
        "w": 128,
        "h": 83,
        "ax": 64,
        "ay": 48,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "ani067_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 127,
        "h": 64,
        "ax": 64,
        "ay": 31,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "ani067_die.webp",
        "n": 6,
        "d": 8,
        "w": 128,
        "h": 77,
        "ax": 64,
        "ay": 42,
        "ms": 222,
        "s": 1
      }
    },
    "boss002": {
      "st": {
        "f": "boss002_st.webp",
        "n": 8,
        "d": 8,
        "w": 120,
        "h": 84,
        "ax": 48,
        "ay": 64,
        "ms": 257,
        "s": 1
      },
      "run": {
        "f": "boss002_run.webp",
        "n": 4,
        "d": 8,
        "w": 121,
        "h": 92,
        "ax": 46,
        "ay": 73,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "boss002_at.webp",
        "n": 8,
        "d": 8,
        "w": 173,
        "h": 145,
        "ax": 71,
        "ay": 114,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "boss002_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 120,
        "h": 84,
        "ax": 48,
        "ay": 64,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "boss002_die.webp",
        "n": 7,
        "d": 8,
        "w": 134,
        "h": 111,
        "ax": 63,
        "ay": 80,
        "ms": 159,
        "s": 1
      }
    },
    "boss003": {
      "st": {
        "f": "boss003_st.webp",
        "n": 8,
        "d": 8,
        "w": 73,
        "h": 87,
        "ax": 23,
        "ay": 78,
        "ms": 257,
        "s": 1
      },
      "run": {
        "f": "boss003_run.webp",
        "n": 4,
        "d": 8,
        "w": 68,
        "h": 91,
        "ax": 23,
        "ay": 78,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "boss003_at.webp",
        "n": 8,
        "d": 8,
        "w": 153,
        "h": 116,
        "ax": 56,
        "ay": 97,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "boss003_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 80,
        "h": 89,
        "ax": 27,
        "ay": 80,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "boss003_die.webp",
        "n": 8,
        "d": 8,
        "w": 183,
        "h": 123,
        "ax": 90,
        "ay": 78,
        "ms": 139,
        "s": 1
      }
    },
    "boss005": {
      "st": {
        "f": "boss005_st.webp",
        "n": 8,
        "d": 8,
        "w": 136,
        "h": 100,
        "ax": 51,
        "ay": 82,
        "ms": 257,
        "s": 1
      },
      "run": {
        "f": "boss005_run.webp",
        "n": 4,
        "d": 8,
        "w": 126,
        "h": 98,
        "ax": 48,
        "ay": 81,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "boss005_at.webp",
        "n": 8,
        "d": 8,
        "w": 188,
        "h": 153,
        "ax": 75,
        "ay": 121,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "boss005_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 136,
        "h": 100,
        "ax": 51,
        "ay": 82,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "boss005_die.webp",
        "n": 7,
        "d": 8,
        "w": 190,
        "h": 130,
        "ax": 83,
        "ay": 91,
        "ms": 159,
        "s": 1
      }
    },
    "boss006": {
      "st": {
        "f": "boss006_st.webp",
        "n": 8,
        "d": 8,
        "w": 76,
        "h": 88,
        "ax": 25,
        "ay": 76,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "boss006_run.webp",
        "n": 4,
        "d": 8,
        "w": 70,
        "h": 85,
        "ax": 24,
        "ay": 75,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "boss006_at.webp",
        "n": 8,
        "d": 8,
        "w": 109,
        "h": 94,
        "ax": 41,
        "ay": 76,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "boss006_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 90,
        "h": 91,
        "ax": 31,
        "ay": 76,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "boss006_die.webp",
        "n": 8,
        "d": 8,
        "w": 158,
        "h": 116,
        "ax": 78,
        "ay": 76,
        "ms": 139,
        "s": 1
      }
    },
    "boss008": {
      "st": {
        "f": "boss008_st.webp",
        "n": 11,
        "d": 8,
        "w": 71,
        "h": 94,
        "ax": 23,
        "ay": 81,
        "ms": 187,
        "s": 1
      },
      "run": {
        "f": "boss008_run.webp",
        "n": 8,
        "d": 8,
        "w": 79,
        "h": 98,
        "ax": 29,
        "ay": 82,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "boss008_at.webp",
        "n": 9,
        "d": 8,
        "w": 94,
        "h": 97,
        "ax": 32,
        "ay": 84,
        "ms": 123,
        "s": 1
      },
      "hurt": {
        "f": "boss008_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 90,
        "h": 100,
        "ax": 33,
        "ay": 83,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "boss008_die.webp",
        "n": 8,
        "d": 8,
        "w": 194,
        "h": 132,
        "ax": 94,
        "ay": 84,
        "ms": 139,
        "s": 1
      }
    },
    "boss013": {
      "st": {
        "f": "boss013_st.webp",
        "n": 10,
        "d": 8,
        "w": 109,
        "h": 101,
        "ax": 35,
        "ay": 87,
        "ms": 206,
        "s": 1
      },
      "run": {
        "f": "boss013_run.webp",
        "n": 7,
        "d": 8,
        "w": 108,
        "h": 106,
        "ax": 36,
        "ay": 87,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "boss013_at.webp",
        "n": 10,
        "d": 8,
        "w": 236,
        "h": 181,
        "ax": 104,
        "ay": 131,
        "ms": 111,
        "s": 1
      },
      "hurt": {
        "f": "boss013_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 108,
        "h": 103,
        "ax": 34,
        "ay": 87,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "boss013_die.webp",
        "n": 8,
        "d": 8,
        "w": 250,
        "h": 147,
        "ax": 120,
        "ay": 87,
        "ms": 139,
        "s": 1
      }
    },
    "boss015": {
      "st": {
        "f": "boss015_st.webp",
        "n": 8,
        "d": 8,
        "w": 102,
        "h": 105,
        "ax": 38,
        "ay": 89,
        "ms": 257,
        "s": 1
      },
      "run": {
        "f": "boss015_run.webp",
        "n": 6,
        "d": 8,
        "w": 104,
        "h": 112,
        "ax": 35,
        "ay": 97,
        "ms": 93,
        "s": 1
      },
      "at": {
        "f": "boss015_at.webp",
        "n": 6,
        "d": 8,
        "w": 228,
        "h": 170,
        "ax": 114,
        "ay": 124,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "boss015_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 109,
        "h": 108,
        "ax": 42,
        "ay": 89,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "boss015_die.webp",
        "n": 7,
        "d": 8,
        "w": 140,
        "h": 126,
        "ax": 51,
        "ay": 100,
        "ms": 159,
        "s": 1
      }
    },
    "boss017": {
      "st": {
        "f": "boss017_st.webp",
        "n": 4,
        "d": 8,
        "w": 99,
        "h": 101,
        "ax": 46,
        "ay": 78,
        "ms": 514,
        "s": 1
      },
      "run": {
        "f": "boss017_run.webp",
        "n": 5,
        "d": 8,
        "w": 113,
        "h": 106,
        "ax": 52,
        "ay": 80,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "boss017_at.webp",
        "n": 5,
        "d": 8,
        "w": 223,
        "h": 150,
        "ax": 96,
        "ay": 105,
        "ms": 222,
        "s": 1
      },
      "hurt": {
        "f": "boss017_hurt.webp",
        "n": 2,
        "d": 8,
        "w": 96,
        "h": 101,
        "ax": 45,
        "ay": 78,
        "ms": 278,
        "s": 1
      },
      "die": {
        "f": "boss017_die.webp",
        "n": 3,
        "d": 8,
        "w": 138,
        "h": 109,
        "ax": 62,
        "ay": 78,
        "ms": 370,
        "s": 1
      }
    },
    "boss019": {
      "st": {
        "f": "boss019_st.webp",
        "n": 8,
        "d": 8,
        "w": 107,
        "h": 104,
        "ax": 50,
        "ay": 80,
        "ms": 194,
        "s": 1
      },
      "run": {
        "f": "boss019_run.webp",
        "n": 6,
        "d": 8,
        "w": 100,
        "h": 99,
        "ax": 38,
        "ay": 84,
        "ms": 148,
        "s": 1
      },
      "at": {
        "f": "boss019_at.webp",
        "n": 6,
        "d": 8,
        "w": 188,
        "h": 138,
        "ax": 85,
        "ay": 99,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "boss019_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 99,
        "h": 103,
        "ax": 43,
        "ay": 80,
        "ms": 181,
        "s": 1
      },
      "die": {
        "f": "boss019_die.webp",
        "n": 4,
        "d": 8,
        "w": 135,
        "h": 111,
        "ax": 64,
        "ay": 80,
        "ms": 389,
        "s": 1
      }
    },
    "boss022": {
      "st": {
        "f": "boss022_st.webp",
        "n": 8,
        "d": 8,
        "w": 95,
        "h": 97,
        "ax": 41,
        "ay": 68,
        "ms": 257,
        "s": 1
      },
      "run": {
        "f": "boss022_run.webp",
        "n": 4,
        "d": 8,
        "w": 118,
        "h": 85,
        "ax": 59,
        "ay": 68,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "boss022_at.webp",
        "n": 4,
        "d": 8,
        "w": 210,
        "h": 141,
        "ax": 94,
        "ay": 89,
        "ms": 278,
        "s": 1
      },
      "hurt": {
        "f": "boss022_hurt.webp",
        "n": 5,
        "d": 8,
        "w": 129,
        "h": 108,
        "ax": 62,
        "ay": 69,
        "ms": 111,
        "s": 1
      },
      "die": {
        "f": "boss022_die.webp",
        "n": 8,
        "d": 8,
        "w": 183,
        "h": 121,
        "ax": 92,
        "ay": 81,
        "ms": 139,
        "s": 1
      }
    },
    "boss024": {
      "st": {
        "f": "boss024_st.webp",
        "n": 8,
        "d": 8,
        "w": 120,
        "h": 109,
        "ax": 56,
        "ay": 80,
        "ms": 257,
        "s": 1
      },
      "run": {
        "f": "boss024_run.webp",
        "n": 4,
        "d": 8,
        "w": 130,
        "h": 95,
        "ax": 65,
        "ay": 83,
        "ms": 139,
        "s": 1
      },
      "at": {
        "f": "boss024_at.webp",
        "n": 5,
        "d": 8,
        "w": 259,
        "h": 155,
        "ax": 119,
        "ay": 98,
        "ms": 222,
        "s": 1
      },
      "hurt": {
        "f": "boss024_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 150,
        "h": 112,
        "ax": 64,
        "ay": 83,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "boss024_die.webp",
        "n": 9,
        "d": 8,
        "w": 179,
        "h": 131,
        "ax": 76,
        "ay": 92,
        "ms": 123,
        "s": 1
      }
    },
    "enemy003": {
      "st": {
        "f": "enemy003_st.webp",
        "n": 6,
        "d": 8,
        "w": 38,
        "h": 74,
        "ax": 19,
        "ay": 67,
        "ms": 222,
        "s": 1
      },
      "run": {
        "f": "enemy003_run.webp",
        "n": 7,
        "d": 8,
        "w": 56,
        "h": 75,
        "ax": 28,
        "ay": 65,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy003_at.webp",
        "n": 7,
        "d": 8,
        "w": 88,
        "h": 91,
        "ax": 44,
        "ay": 78,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy003_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 80,
        "h": 77,
        "ax": 40,
        "ay": 68,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "enemy003_die.webp",
        "n": 7,
        "d": 8,
        "w": 174,
        "h": 116,
        "ax": 87,
        "ay": 75,
        "ms": 159,
        "s": 1
      }
    },
    "enemy021": {
      "st": {
        "f": "enemy021_st.webp",
        "n": 8,
        "d": 8,
        "w": 120,
        "h": 111,
        "ax": 60,
        "ay": 96,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy021_run.webp",
        "n": 7,
        "d": 8,
        "w": 116,
        "h": 113,
        "ax": 58,
        "ay": 101,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy021_at.webp",
        "n": 8,
        "d": 8,
        "w": 184,
        "h": 159,
        "ax": 92,
        "ay": 141,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy021_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 146,
        "h": 101,
        "ax": 73,
        "ay": 90,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "enemy021_die.webp",
        "n": 8,
        "d": 8,
        "w": 286,
        "h": 176,
        "ax": 143,
        "ay": 108,
        "ms": 139,
        "s": 1
      }
    },
    "enemy023": {
      "st": {
        "f": "enemy023_st.webp",
        "n": 10,
        "d": 8,
        "w": 110,
        "h": 96,
        "ax": 55,
        "ay": 84,
        "ms": 200,
        "s": 1
      },
      "run": {
        "f": "enemy023_run.webp",
        "n": 7,
        "d": 8,
        "w": 132,
        "h": 99,
        "ax": 66,
        "ay": 84,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy023_at.webp",
        "n": 11,
        "d": 8,
        "w": 176,
        "h": 161,
        "ax": 88,
        "ay": 141,
        "ms": 101,
        "s": 1
      },
      "hurt": {
        "f": "enemy023_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 172,
        "h": 116,
        "ax": 86,
        "ay": 104,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy023_die.webp",
        "n": 10,
        "d": 8,
        "w": 280,
        "h": 183,
        "ax": 140,
        "ay": 115,
        "ms": 111,
        "s": 1
      }
    },
    "enemy024": {
      "st": {
        "f": "enemy024_st.webp",
        "n": 10,
        "d": 8,
        "w": 106,
        "h": 85,
        "ax": 53,
        "ay": 74,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy024_run.webp",
        "n": 7,
        "d": 8,
        "w": 62,
        "h": 89,
        "ax": 31,
        "ay": 76,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy024_at.webp",
        "n": 7,
        "d": 8,
        "w": 176,
        "h": 112,
        "ax": 88,
        "ay": 98,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy024_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 106,
        "h": 100,
        "ax": 53,
        "ay": 75,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy024_die.webp",
        "n": 9,
        "d": 8,
        "w": 242,
        "h": 155,
        "ax": 121,
        "ay": 98,
        "ms": 123,
        "s": 1
      }
    },
    "enemy028": {
      "st": {
        "f": "enemy028_st.webp",
        "n": 10,
        "d": 8,
        "w": 56,
        "h": 80,
        "ax": 28,
        "ay": 70,
        "ms": 133,
        "s": 1
      },
      "run": {
        "f": "enemy028_run.webp",
        "n": 8,
        "d": 8,
        "w": 58,
        "h": 82,
        "ax": 29,
        "ay": 70,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy028_at.webp",
        "n": 10,
        "d": 8,
        "w": 96,
        "h": 92,
        "ax": 48,
        "ay": 82,
        "ms": 111,
        "s": 1
      },
      "hurt": {
        "f": "enemy028_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 82,
        "h": 95,
        "ax": 41,
        "ay": 85,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy028_die.webp",
        "n": 8,
        "d": 8,
        "w": 272,
        "h": 153,
        "ax": 136,
        "ay": 94,
        "ms": 139,
        "s": 1
      }
    },
    "enemy029": {
      "st": {
        "f": "enemy029_st.webp",
        "n": 15,
        "d": 8,
        "w": 92,
        "h": 80,
        "ax": 46,
        "ay": 71,
        "ms": 122,
        "s": 1
      },
      "run": {
        "f": "enemy029_run.webp",
        "n": 8,
        "d": 8,
        "w": 98,
        "h": 89,
        "ax": 49,
        "ay": 76,
        "ms": 181,
        "s": 1
      },
      "at": {
        "f": "enemy029_at.webp",
        "n": 6,
        "d": 8,
        "w": 158,
        "h": 108,
        "ax": 79,
        "ay": 93,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "enemy029_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 90,
        "h": 94,
        "ax": 45,
        "ay": 75,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "enemy029_die.webp",
        "n": 6,
        "d": 8,
        "w": 136,
        "h": 117,
        "ax": 68,
        "ay": 82,
        "ms": 213,
        "s": 1
      }
    },
    "enemy036": {
      "st": {
        "f": "enemy036_st.webp",
        "n": 10,
        "d": 8,
        "w": 136,
        "h": 90,
        "ax": 68,
        "ay": 76,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy036_run.webp",
        "n": 7,
        "d": 8,
        "w": 114,
        "h": 120,
        "ax": 55,
        "ay": 116,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy036_at.webp",
        "n": 8,
        "d": 8,
        "w": 200,
        "h": 170,
        "ax": 100,
        "ay": 123,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy036_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 132,
        "h": 149,
        "ax": 66,
        "ay": 133,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy036_die.webp",
        "n": 8,
        "d": 8,
        "w": 160,
        "h": 153,
        "ax": 80,
        "ay": 112,
        "ms": 139,
        "s": 1
      }
    },
    "enemy040": {
      "st": {
        "f": "enemy040_st.webp",
        "n": 14,
        "d": 8,
        "w": 96,
        "h": 84,
        "ax": 48,
        "ay": 69,
        "ms": 131,
        "s": 1
      },
      "run": {
        "f": "enemy040_run.webp",
        "n": 8,
        "d": 8,
        "w": 106,
        "h": 82,
        "ax": 53,
        "ay": 69,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy040_at.webp",
        "n": 9,
        "d": 8,
        "w": 154,
        "h": 112,
        "ax": 77,
        "ay": 93,
        "ms": 123,
        "s": 1
      },
      "hurt": {
        "f": "enemy040_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 94,
        "h": 91,
        "ax": 47,
        "ay": 70,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy040_die.webp",
        "n": 7,
        "d": 8,
        "w": 156,
        "h": 118,
        "ax": 78,
        "ay": 80,
        "ms": 159,
        "s": 1
      }
    },
    "enemy048": {
      "st": {
        "f": "enemy048_st.webp",
        "n": 12,
        "d": 8,
        "w": 73,
        "h": 80,
        "ax": 37,
        "ay": 68,
        "ms": 125,
        "s": 1
      },
      "run": {
        "f": "enemy048_run.webp",
        "n": 8,
        "d": 8,
        "w": 70,
        "h": 79,
        "ax": 35,
        "ay": 68,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy048_at.webp",
        "n": 7,
        "d": 8,
        "w": 156,
        "h": 117,
        "ax": 78,
        "ay": 97,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy048_hurt.webp",
        "n": 5,
        "d": 8,
        "w": 104,
        "h": 99,
        "ax": 52,
        "ay": 87,
        "ms": 111,
        "s": 1
      },
      "die": {
        "f": "enemy048_die.webp",
        "n": 9,
        "d": 8,
        "w": 201,
        "h": 133,
        "ax": 100,
        "ay": 84,
        "ms": 204,
        "s": 1
      }
    },
    "enemy050": {
      "st": {
        "f": "enemy050_st.webp",
        "n": 15,
        "d": 8,
        "w": 87,
        "h": 80,
        "ax": 43,
        "ay": 65,
        "ms": 133,
        "s": 1
      },
      "run": {
        "f": "enemy050_run.webp",
        "n": 7,
        "d": 8,
        "w": 111,
        "h": 79,
        "ax": 56,
        "ay": 66,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy050_at.webp",
        "n": 8,
        "d": 8,
        "w": 144,
        "h": 88,
        "ax": 72,
        "ay": 73,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy050_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 98,
        "h": 83,
        "ax": 49,
        "ay": 65,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy050_die.webp",
        "n": 6,
        "d": 8,
        "w": 138,
        "h": 134,
        "ax": 69,
        "ay": 98,
        "ms": 222,
        "s": 1
      }
    },
    "enemy051": {
      "st": {
        "f": "enemy051_st.webp",
        "n": 10,
        "d": 8,
        "w": 48,
        "h": 86,
        "ax": 24,
        "ay": 70,
        "ms": 150,
        "s": 1
      },
      "run": {
        "f": "enemy051_run.webp",
        "n": 8,
        "d": 8,
        "w": 90,
        "h": 75,
        "ax": 45,
        "ay": 64,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy051_at.webp",
        "n": 7,
        "d": 8,
        "w": 127,
        "h": 89,
        "ax": 63,
        "ay": 70,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy051_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 65,
        "h": 86,
        "ax": 32,
        "ay": 70,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "enemy051_die.webp",
        "n": 8,
        "d": 8,
        "w": 114,
        "h": 104,
        "ax": 57,
        "ay": 69,
        "ms": 167,
        "s": 1
      }
    },
    "enemy067": {
      "st": {
        "f": "enemy067_st.webp",
        "n": 15,
        "d": 8,
        "w": 48,
        "h": 91,
        "ax": 24,
        "ay": 80,
        "ms": 133,
        "s": 1
      },
      "run": {
        "f": "enemy067_run.webp",
        "n": 7,
        "d": 8,
        "w": 110,
        "h": 81,
        "ax": 55,
        "ay": 68,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy067_at.webp",
        "n": 8,
        "d": 8,
        "w": 152,
        "h": 120,
        "ax": 76,
        "ay": 108,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy067_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 70,
        "h": 90,
        "ax": 35,
        "ay": 79,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy067_die.webp",
        "n": 8,
        "d": 8,
        "w": 228,
        "h": 162,
        "ax": 114,
        "ay": 103,
        "ms": 139,
        "s": 1
      }
    },
    "enemy069": {
      "st": {
        "f": "enemy069_st.webp",
        "n": 7,
        "d": 8,
        "w": 80,
        "h": 70,
        "ax": 40,
        "ay": 63,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy069_run.webp",
        "n": 8,
        "d": 8,
        "w": 82,
        "h": 78,
        "ax": 41,
        "ay": 70,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy069_at.webp",
        "n": 8,
        "d": 8,
        "w": 104,
        "h": 94,
        "ax": 52,
        "ay": 73,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy069_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 80,
        "h": 73,
        "ax": 40,
        "ay": 66,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy069_die.webp",
        "n": 5,
        "d": 8,
        "w": 83,
        "h": 82,
        "ax": 41,
        "ay": 63,
        "ms": 222,
        "s": 1
      }
    },
    "enemy070": {
      "st": {
        "f": "enemy070_st.webp",
        "n": 12,
        "d": 8,
        "w": 86,
        "h": 78,
        "ax": 43,
        "ay": 63,
        "ms": 120,
        "s": 1
      },
      "run": {
        "f": "enemy070_run.webp",
        "n": 7,
        "d": 8,
        "w": 76,
        "h": 80,
        "ax": 38,
        "ay": 67,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy070_at.webp",
        "n": 8,
        "d": 8,
        "w": 142,
        "h": 118,
        "ax": 71,
        "ay": 97,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy070_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 86,
        "h": 78,
        "ax": 43,
        "ay": 63,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy070_die.webp",
        "n": 8,
        "d": 8,
        "w": 166,
        "h": 111,
        "ax": 83,
        "ay": 67,
        "ms": 167,
        "s": 1
      }
    },
    "enemy076": {
      "st": {
        "f": "enemy076_st.webp",
        "n": 15,
        "d": 8,
        "w": 94,
        "h": 86,
        "ax": 47,
        "ay": 71,
        "ms": 148,
        "s": 1
      },
      "run": {
        "f": "enemy076_run.webp",
        "n": 7,
        "d": 8,
        "w": 114,
        "h": 89,
        "ax": 57,
        "ay": 75,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy076_at.webp",
        "n": 8,
        "d": 8,
        "w": 148,
        "h": 94,
        "ax": 74,
        "ay": 79,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy076_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 90,
        "h": 87,
        "ax": 45,
        "ay": 71,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy076_die.webp",
        "n": 6,
        "d": 8,
        "w": 102,
        "h": 106,
        "ax": 51,
        "ay": 80,
        "ms": 222,
        "s": 1
      }
    },
    "enemy078": {
      "st": {
        "f": "enemy078_st.webp",
        "n": 8,
        "d": 8,
        "w": 64,
        "h": 84,
        "ax": 32,
        "ay": 71,
        "ms": 188,
        "s": 1
      },
      "run": {
        "f": "enemy078_run.webp",
        "n": 10,
        "d": 8,
        "w": 64,
        "h": 88,
        "ax": 32,
        "ay": 73,
        "ms": 56,
        "s": 1
      },
      "at": {
        "f": "enemy078_at.webp",
        "n": 11,
        "d": 8,
        "w": 148,
        "h": 131,
        "ax": 74,
        "ay": 118,
        "ms": 101,
        "s": 1
      },
      "hurt": {
        "f": "enemy078_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 76,
        "h": 84,
        "ax": 38,
        "ay": 71,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy078_die.webp",
        "n": 6,
        "d": 8,
        "w": 122,
        "h": 104,
        "ax": 61,
        "ay": 72,
        "ms": 185,
        "s": 1
      }
    },
    "enemy081": {
      "st": {
        "f": "enemy081_st.webp",
        "n": 10,
        "d": 8,
        "w": 36,
        "h": 77,
        "ax": 18,
        "ay": 68,
        "ms": 194,
        "s": 1
      },
      "run": {
        "f": "enemy081_run.webp",
        "n": 8,
        "d": 8,
        "w": 52,
        "h": 81,
        "ax": 26,
        "ay": 67,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy081_at.webp",
        "n": 6,
        "d": 8,
        "w": 102,
        "h": 96,
        "ax": 51,
        "ay": 77,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "enemy081_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 50,
        "h": 78,
        "ax": 25,
        "ay": 69,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "enemy081_die.webp",
        "n": 7,
        "d": 8,
        "w": 166,
        "h": 123,
        "ax": 83,
        "ay": 81,
        "ms": 159,
        "s": 1
      }
    },
    "enemy082": {
      "st": {
        "f": "enemy082_st.webp",
        "n": 14,
        "d": 8,
        "w": 130,
        "h": 80,
        "ax": 65,
        "ay": 69,
        "ms": 139,
        "s": 1
      },
      "run": {
        "f": "enemy082_run.webp",
        "n": 8,
        "d": 8,
        "w": 78,
        "h": 88,
        "ax": 39,
        "ay": 76,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy082_at.webp",
        "n": 7,
        "d": 8,
        "w": 168,
        "h": 130,
        "ax": 84,
        "ay": 108,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy082_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 130,
        "h": 82,
        "ax": 65,
        "ay": 71,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "enemy082_die.webp",
        "n": 5,
        "d": 8,
        "w": 130,
        "h": 118,
        "ax": 65,
        "ay": 69,
        "ms": 222,
        "s": 1
      }
    },
    "enemy083": {
      "st": {
        "f": "enemy083_st.webp",
        "n": 12,
        "d": 8,
        "w": 88,
        "h": 91,
        "ax": 44,
        "ay": 68,
        "ms": 139,
        "s": 1
      },
      "run": {
        "f": "enemy083_run.webp",
        "n": 7,
        "d": 8,
        "w": 84,
        "h": 90,
        "ax": 42,
        "ay": 68,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy083_at.webp",
        "n": 8,
        "d": 8,
        "w": 168,
        "h": 136,
        "ax": 84,
        "ay": 109,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy083_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 90,
        "h": 92,
        "ax": 45,
        "ay": 68,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy083_die.webp",
        "n": 8,
        "d": 8,
        "w": 206,
        "h": 127,
        "ax": 103,
        "ay": 78,
        "ms": 139,
        "s": 1
      }
    },
    "enemy086": {
      "st": {
        "f": "enemy086_st.webp",
        "n": 10,
        "d": 8,
        "w": 80,
        "h": 83,
        "ax": 40,
        "ay": 72,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy086_run.webp",
        "n": 7,
        "d": 8,
        "w": 100,
        "h": 82,
        "ax": 50,
        "ay": 74,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy086_at.webp",
        "n": 10,
        "d": 8,
        "w": 136,
        "h": 126,
        "ax": 68,
        "ay": 112,
        "ms": 111,
        "s": 1
      },
      "hurt": {
        "f": "enemy086_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 90,
        "h": 85,
        "ax": 45,
        "ay": 74,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy086_die.webp",
        "n": 8,
        "d": 8,
        "w": 282,
        "h": 174,
        "ax": 141,
        "ay": 107,
        "ms": 139,
        "s": 1
      }
    },
    "enemy089": {
      "st": {
        "f": "enemy089_st.webp",
        "n": 10,
        "d": 8,
        "w": 86,
        "h": 83,
        "ax": 41,
        "ay": 72,
        "ms": 222,
        "s": 1
      },
      "run": {
        "f": "enemy089_run.webp",
        "n": 7,
        "d": 8,
        "w": 56,
        "h": 97,
        "ax": 26,
        "ay": 86,
        "ms": 190,
        "s": 1
      },
      "at": {
        "f": "enemy089_at.webp",
        "n": 8,
        "d": 8,
        "w": 140,
        "h": 132,
        "ax": 70,
        "ay": 100,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy089_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 82,
        "h": 89,
        "ax": 39,
        "ay": 73,
        "ms": 208,
        "s": 1
      },
      "die": {
        "f": "enemy089_die.webp",
        "n": 8,
        "d": 8,
        "w": 126,
        "h": 115,
        "ax": 61,
        "ay": 83,
        "ms": 229,
        "s": 1
      }
    },
    "enemy107": {
      "st": {
        "f": "enemy107_st.webp",
        "n": 12,
        "d": 8,
        "w": 56,
        "h": 84,
        "ax": 28,
        "ay": 71,
        "ms": 148,
        "s": 1
      },
      "run": {
        "f": "enemy107_run.webp",
        "n": 15,
        "d": 8,
        "w": 50,
        "h": 81,
        "ax": 25,
        "ay": 69,
        "ms": 37,
        "s": 1
      },
      "at": {
        "f": "enemy107_at.webp",
        "n": 6,
        "d": 8,
        "w": 78,
        "h": 93,
        "ax": 39,
        "ay": 73,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "enemy107_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 88,
        "h": 93,
        "ax": 44,
        "ay": 76,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "enemy107_die.webp",
        "n": 6,
        "d": 8,
        "w": 212,
        "h": 121,
        "ax": 106,
        "ay": 74,
        "ms": 185,
        "s": 1
      }
    },
    "enemy109": {
      "st": {
        "f": "enemy109_st.webp",
        "n": 12,
        "d": 8,
        "w": 38,
        "h": 78,
        "ax": 19,
        "ay": 71,
        "ms": 139,
        "s": 1
      },
      "run": {
        "f": "enemy109_run.webp",
        "n": 8,
        "d": 8,
        "w": 54,
        "h": 80,
        "ax": 27,
        "ay": 70,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "enemy109_at.webp",
        "n": 6,
        "d": 8,
        "w": 104,
        "h": 99,
        "ax": 52,
        "ay": 79,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "enemy109_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 48,
        "h": 81,
        "ax": 24,
        "ay": 74,
        "ms": 181,
        "s": 1
      },
      "die": {
        "f": "enemy109_die.webp",
        "n": 6,
        "d": 8,
        "w": 144,
        "h": 107,
        "ax": 72,
        "ay": 73,
        "ms": 259,
        "s": 1
      }
    },
    "enemy121": {
      "st": {
        "f": "enemy121_st.webp",
        "n": 6,
        "d": 8,
        "w": 36,
        "h": 79,
        "ax": 18,
        "ay": 68,
        "ms": 278,
        "s": 1
      },
      "run": {
        "f": "enemy121_run.webp",
        "n": 8,
        "d": 8,
        "w": 52,
        "h": 79,
        "ax": 26,
        "ay": 69,
        "ms": 104,
        "s": 1
      },
      "at": {
        "f": "enemy121_at.webp",
        "n": 10,
        "d": 8,
        "w": 125,
        "h": 95,
        "ax": 47,
        "ay": 78,
        "ms": 111,
        "s": 1
      },
      "hurt": {
        "f": "enemy121_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 82,
        "h": 88,
        "ax": 41,
        "ay": 74,
        "ms": 181,
        "s": 1
      },
      "die": {
        "f": "enemy121_die.webp",
        "n": 8,
        "d": 8,
        "w": 168,
        "h": 118,
        "ax": 84,
        "ay": 74,
        "ms": 208,
        "s": 1
      }
    },
    "enemy122": {
      "st": {
        "f": "enemy122_st.webp",
        "n": 13,
        "d": 8,
        "w": 98,
        "h": 82,
        "ax": 49,
        "ay": 74,
        "ms": 150,
        "s": 1
      },
      "run": {
        "f": "enemy122_run.webp",
        "n": 9,
        "d": 8,
        "w": 106,
        "h": 92,
        "ax": 53,
        "ay": 76,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "enemy122_at.webp",
        "n": 7,
        "d": 8,
        "w": 136,
        "h": 116,
        "ax": 68,
        "ay": 102,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy122_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 100,
        "h": 87,
        "ax": 50,
        "ay": 76,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "enemy122_die.webp",
        "n": 7,
        "d": 8,
        "w": 160,
        "h": 140,
        "ax": 80,
        "ay": 99,
        "ms": 214,
        "s": 1
      }
    },
    "enemy123": {
      "st": {
        "f": "enemy123_st.webp",
        "n": 12,
        "d": 8,
        "w": 104,
        "h": 82,
        "ax": 52,
        "ay": 70,
        "ms": 139,
        "s": 1
      },
      "run": {
        "f": "enemy123_run.webp",
        "n": 8,
        "d": 8,
        "w": 90,
        "h": 99,
        "ax": 45,
        "ay": 87,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "enemy123_at.webp",
        "n": 7,
        "d": 8,
        "w": 142,
        "h": 132,
        "ax": 71,
        "ay": 109,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy123_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 104,
        "h": 88,
        "ax": 52,
        "ay": 70,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "enemy123_die.webp",
        "n": 8,
        "d": 8,
        "w": 170,
        "h": 127,
        "ax": 85,
        "ay": 87,
        "ms": 208,
        "s": 1
      }
    },
    "enemy124": {
      "st": {
        "f": "enemy124_st.webp",
        "n": 6,
        "d": 8,
        "w": 42,
        "h": 81,
        "ax": 21,
        "ay": 69,
        "ms": 278,
        "s": 1
      },
      "run": {
        "f": "enemy124_run.webp",
        "n": 15,
        "d": 8,
        "w": 38,
        "h": 79,
        "ax": 19,
        "ay": 70,
        "ms": 67,
        "s": 1
      },
      "at": {
        "f": "enemy124_at.webp",
        "n": 8,
        "d": 8,
        "w": 58,
        "h": 91,
        "ax": 29,
        "ay": 78,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy124_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 60,
        "h": 85,
        "ax": 30,
        "ay": 73,
        "ms": 181,
        "s": 1
      },
      "die": {
        "f": "enemy124_die.webp",
        "n": 9,
        "d": 8,
        "w": 144,
        "h": 109,
        "ax": 72,
        "ay": 72,
        "ms": 222,
        "s": 1
      }
    },
    "enemy125": {
      "st": {
        "f": "enemy125_st.webp",
        "n": 12,
        "d": 8,
        "w": 159,
        "h": 110,
        "ax": 68,
        "ay": 73,
        "ms": 153,
        "s": 1
      },
      "run": {
        "f": "enemy125_run.webp",
        "n": 8,
        "d": 8,
        "w": 153,
        "h": 112,
        "ax": 63,
        "ay": 78,
        "ms": 125,
        "s": 1
      },
      "at": {
        "f": "enemy125_at.webp",
        "n": 6,
        "d": 8,
        "w": 198,
        "h": 165,
        "ax": 70,
        "ay": 126,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "enemy125_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 156,
        "h": 109,
        "ax": 66,
        "ay": 73,
        "ms": 181,
        "s": 1
      },
      "die": {
        "f": "enemy125_die.webp",
        "n": 8,
        "d": 8,
        "w": 196,
        "h": 131,
        "ax": 95,
        "ay": 76,
        "ms": 229,
        "s": 1
      }
    },
    "enemy126": {
      "st": {
        "f": "enemy126_st.webp",
        "n": 12,
        "d": 8,
        "w": 50,
        "h": 101,
        "ax": 25,
        "ay": 90,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy126_run.webp",
        "n": 7,
        "d": 8,
        "w": 98,
        "h": 105,
        "ax": 49,
        "ay": 94,
        "ms": 151,
        "s": 1
      },
      "at": {
        "f": "enemy126_at.webp",
        "n": 8,
        "d": 8,
        "w": 191,
        "h": 161,
        "ax": 96,
        "ay": 113,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy126_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 98,
        "h": 100,
        "ax": 49,
        "ay": 89,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "enemy126_die.webp",
        "n": 9,
        "d": 8,
        "w": 168,
        "h": 133,
        "ax": 84,
        "ay": 89,
        "ms": 222,
        "s": 1
      }
    },
    "enemy127": {
      "st": {
        "f": "enemy127_st.webp",
        "n": 12,
        "d": 8,
        "w": 66,
        "h": 80,
        "ax": 33,
        "ay": 72,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy127_run.webp",
        "n": 8,
        "d": 8,
        "w": 62,
        "h": 97,
        "ax": 31,
        "ay": 82,
        "ms": 125,
        "s": 1
      },
      "at": {
        "f": "enemy127_at.webp",
        "n": 7,
        "d": 8,
        "w": 160,
        "h": 156,
        "ax": 80,
        "ay": 117,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy127_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 70,
        "h": 84,
        "ax": 35,
        "ay": 75,
        "ms": 194,
        "s": 1
      },
      "die": {
        "f": "enemy127_die.webp",
        "n": 11,
        "d": 8,
        "w": 269,
        "h": 153,
        "ax": 135,
        "ay": 85,
        "ms": 212,
        "s": 1
      }
    },
    "enemy128": {
      "st": {
        "f": "enemy128_st.webp",
        "n": 11,
        "d": 8,
        "w": 84,
        "h": 92,
        "ax": 42,
        "ay": 71,
        "ms": 182,
        "s": 1
      },
      "run": {
        "f": "enemy128_run.webp",
        "n": 7,
        "d": 8,
        "w": 110,
        "h": 90,
        "ax": 55,
        "ay": 71,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy128_at.webp",
        "n": 7,
        "d": 8,
        "w": 163,
        "h": 119,
        "ax": 82,
        "ay": 99,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy128_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 107,
        "h": 96,
        "ax": 54,
        "ay": 75,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy128_die.webp",
        "n": 8,
        "d": 8,
        "w": 270,
        "h": 149,
        "ax": 135,
        "ay": 84,
        "ms": 139,
        "s": 1
      }
    },
    "enemy129": {
      "st": {
        "f": "enemy129_st.webp",
        "n": 10,
        "d": 8,
        "w": 92,
        "h": 91,
        "ax": 46,
        "ay": 81,
        "ms": 200,
        "s": 1
      },
      "run": {
        "f": "enemy129_run.webp",
        "n": 8,
        "d": 8,
        "w": 108,
        "h": 96,
        "ax": 54,
        "ay": 82,
        "ms": 125,
        "s": 1
      },
      "at": {
        "f": "enemy129_at.webp",
        "n": 7,
        "d": 8,
        "w": 164,
        "h": 116,
        "ax": 82,
        "ay": 96,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy129_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 92,
        "h": 96,
        "ax": 46,
        "ay": 86,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "enemy129_die.webp",
        "n": 7,
        "d": 8,
        "w": 212,
        "h": 128,
        "ax": 106,
        "ay": 89,
        "ms": 246,
        "s": 1
      }
    },
    "enemy130": {
      "st": {
        "f": "enemy130_st.webp",
        "n": 10,
        "d": 8,
        "w": 86,
        "h": 113,
        "ax": 43,
        "ay": 105,
        "ms": 150,
        "s": 1
      },
      "run": {
        "f": "enemy130_run.webp",
        "n": 8,
        "d": 8,
        "w": 88,
        "h": 95,
        "ax": 44,
        "ay": 84,
        "ms": 104,
        "s": 1
      },
      "at": {
        "f": "enemy130_at.webp",
        "n": 9,
        "d": 8,
        "w": 180,
        "h": 117,
        "ax": 90,
        "ay": 102,
        "ms": 123,
        "s": 1
      },
      "hurt": {
        "f": "enemy130_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 87,
        "h": 111,
        "ax": 44,
        "ay": 103,
        "ms": 241,
        "s": 1
      },
      "die": {
        "f": "enemy130_die.webp",
        "n": 8,
        "d": 8,
        "w": 164,
        "h": 142,
        "ax": 82,
        "ay": 101,
        "ms": 229,
        "s": 1
      }
    },
    "enemy131": {
      "st": {
        "f": "enemy131_st.webp",
        "n": 10,
        "d": 8,
        "w": 102,
        "h": 73,
        "ax": 51,
        "ay": 55,
        "ms": 194,
        "s": 1
      },
      "run": {
        "f": "enemy131_run.webp",
        "n": 8,
        "d": 8,
        "w": 128,
        "h": 80,
        "ax": 64,
        "ay": 59,
        "ms": 125,
        "s": 1
      },
      "at": {
        "f": "enemy131_at.webp",
        "n": 6,
        "d": 8,
        "w": 182,
        "h": 133,
        "ax": 91,
        "ay": 104,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "enemy131_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 102,
        "h": 79,
        "ax": 51,
        "ay": 61,
        "ms": 194,
        "s": 1
      },
      "die": {
        "f": "enemy131_die.webp",
        "n": 7,
        "d": 8,
        "w": 172,
        "h": 105,
        "ax": 86,
        "ay": 73,
        "ms": 190,
        "s": 1
      }
    },
    "enemy132": {
      "st": {
        "f": "enemy132_st.webp",
        "n": 10,
        "d": 8,
        "w": 62,
        "h": 73,
        "ax": 31,
        "ay": 63,
        "ms": 194,
        "s": 1
      },
      "run": {
        "f": "enemy132_run.webp",
        "n": 8,
        "d": 8,
        "w": 66,
        "h": 85,
        "ax": 33,
        "ay": 73,
        "ms": 111,
        "s": 1
      },
      "at": {
        "f": "enemy132_at.webp",
        "n": 10,
        "d": 8,
        "w": 99,
        "h": 101,
        "ax": 50,
        "ay": 91,
        "ms": 111,
        "s": 1
      },
      "hurt": {
        "f": "enemy132_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 62,
        "h": 75,
        "ax": 31,
        "ay": 65,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy132_die.webp",
        "n": 7,
        "d": 8,
        "w": 200,
        "h": 115,
        "ax": 100,
        "ay": 65,
        "ms": 222,
        "s": 1
      }
    },
    "enemy133": {
      "st": {
        "f": "enemy133_st.webp",
        "n": 10,
        "d": 8,
        "w": 60,
        "h": 76,
        "ax": 30,
        "ay": 67,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy133_run.webp",
        "n": 8,
        "d": 8,
        "w": 70,
        "h": 78,
        "ax": 35,
        "ay": 68,
        "ms": 132,
        "s": 1
      },
      "at": {
        "f": "enemy133_at.webp",
        "n": 7,
        "d": 8,
        "w": 132,
        "h": 99,
        "ax": 66,
        "ay": 86,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy133_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 60,
        "h": 78,
        "ax": 30,
        "ay": 69,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy133_die.webp",
        "n": 8,
        "d": 8,
        "w": 168,
        "h": 108,
        "ax": 84,
        "ay": 67,
        "ms": 264,
        "s": 1
      }
    },
    "enemy134": {
      "st": {
        "f": "enemy134_st.webp",
        "n": 14,
        "d": 8,
        "w": 52,
        "h": 73,
        "ax": 26,
        "ay": 64,
        "ms": 119,
        "s": 1
      },
      "run": {
        "f": "enemy134_run.webp",
        "n": 7,
        "d": 8,
        "w": 62,
        "h": 74,
        "ax": 31,
        "ay": 64,
        "ms": 79,
        "s": 1
      },
      "at": {
        "f": "enemy134_at.webp",
        "n": 8,
        "d": 8,
        "w": 102,
        "h": 95,
        "ax": 51,
        "ay": 84,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy134_hurt.webp",
        "n": 5,
        "d": 8,
        "w": 54,
        "h": 72,
        "ax": 27,
        "ay": 63,
        "ms": 111,
        "s": 1
      },
      "die": {
        "f": "enemy134_die.webp",
        "n": 7,
        "d": 8,
        "w": 205,
        "h": 139,
        "ax": 102,
        "ay": 91,
        "ms": 159,
        "s": 1
      }
    },
    "enemy135": {
      "st": {
        "f": "enemy135_st.webp",
        "n": 10,
        "d": 8,
        "w": 42,
        "h": 72,
        "ax": 21,
        "ay": 61,
        "ms": 200,
        "s": 1
      },
      "run": {
        "f": "enemy135_run.webp",
        "n": 8,
        "d": 8,
        "w": 50,
        "h": 75,
        "ax": 25,
        "ay": 63,
        "ms": 125,
        "s": 1
      },
      "at": {
        "f": "enemy135_at.webp",
        "n": 7,
        "d": 8,
        "w": 88,
        "h": 77,
        "ax": 44,
        "ay": 66,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy135_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 62,
        "h": 74,
        "ax": 31,
        "ay": 62,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy135_die.webp",
        "n": 8,
        "d": 8,
        "w": 154,
        "h": 99,
        "ax": 77,
        "ay": 61,
        "ms": 264,
        "s": 1
      }
    },
    "enemy136": {
      "st": {
        "f": "enemy136_st.webp",
        "n": 10,
        "d": 8,
        "w": 98,
        "h": 77,
        "ax": 49,
        "ay": 66,
        "ms": 222,
        "s": 1
      },
      "run": {
        "f": "enemy136_run.webp",
        "n": 10,
        "d": 8,
        "w": 110,
        "h": 99,
        "ax": 55,
        "ay": 85,
        "ms": 133,
        "s": 1
      },
      "at": {
        "f": "enemy136_at.webp",
        "n": 7,
        "d": 8,
        "w": 182,
        "h": 129,
        "ax": 91,
        "ay": 110,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy136_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 96,
        "h": 85,
        "ax": 48,
        "ay": 70,
        "ms": 278,
        "s": 1
      },
      "die": {
        "f": "enemy136_die.webp",
        "n": 7,
        "d": 8,
        "w": 132,
        "h": 124,
        "ax": 66,
        "ay": 90,
        "ms": 262,
        "s": 1
      }
    },
    "enemy137": {
      "st": {
        "f": "enemy137_st.webp",
        "n": 10,
        "d": 8,
        "w": 114,
        "h": 95,
        "ax": 57,
        "ay": 83,
        "ms": 200,
        "s": 1
      },
      "run": {
        "f": "enemy137_run.webp",
        "n": 8,
        "d": 8,
        "w": 86,
        "h": 86,
        "ax": 43,
        "ay": 77,
        "ms": 132,
        "s": 1
      },
      "at": {
        "f": "enemy137_at.webp",
        "n": 9,
        "d": 8,
        "w": 225,
        "h": 124,
        "ax": 112,
        "ay": 104,
        "ms": 123,
        "s": 1
      },
      "hurt": {
        "f": "enemy137_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 114,
        "h": 100,
        "ax": 57,
        "ay": 88,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy137_die.webp",
        "n": 7,
        "d": 8,
        "w": 112,
        "h": 107,
        "ax": 56,
        "ay": 76,
        "ms": 254,
        "s": 1
      }
    },
    "enemy138": {
      "st": {
        "f": "enemy138_st.webp",
        "n": 12,
        "d": 8,
        "w": 74,
        "h": 104,
        "ax": 37,
        "ay": 92,
        "ms": 153,
        "s": 1
      },
      "run": {
        "f": "enemy138_run.webp",
        "n": 7,
        "d": 8,
        "w": 86,
        "h": 105,
        "ax": 43,
        "ay": 92,
        "ms": 143,
        "s": 1
      },
      "at": {
        "f": "enemy138_at.webp",
        "n": 9,
        "d": 8,
        "w": 224,
        "h": 140,
        "ax": 112,
        "ay": 123,
        "ms": 123,
        "s": 1
      },
      "hurt": {
        "f": "enemy138_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 92,
        "h": 110,
        "ax": 46,
        "ay": 98,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy138_die.webp",
        "n": 6,
        "d": 8,
        "w": 218,
        "h": 133,
        "ax": 109,
        "ay": 93,
        "ms": 259,
        "s": 1
      }
    },
    "enemy139": {
      "st": {
        "f": "enemy139_st.webp",
        "n": 6,
        "d": 8,
        "w": 30,
        "h": 72,
        "ax": 15,
        "ay": 63,
        "ms": 185,
        "s": 1
      },
      "run": {
        "f": "enemy139_run.webp",
        "n": 8,
        "d": 8,
        "w": 46,
        "h": 74,
        "ax": 23,
        "ay": 63,
        "ms": 104,
        "s": 1
      },
      "at": {
        "f": "enemy139_at.webp",
        "n": 10,
        "d": 8,
        "w": 100,
        "h": 84,
        "ax": 50,
        "ay": 63,
        "ms": 111,
        "s": 1
      },
      "hurt": {
        "f": "enemy139_hurt.webp",
        "n": 7,
        "d": 8,
        "w": 60,
        "h": 74,
        "ax": 30,
        "ay": 64,
        "ms": 222,
        "s": 1
      },
      "die": {
        "f": "enemy139_die.webp",
        "n": 8,
        "d": 8,
        "w": 98,
        "h": 99,
        "ax": 49,
        "ay": 76,
        "ms": 208,
        "s": 1
      }
    },
    "enemy140": {
      "st": {
        "f": "enemy140_st.webp",
        "n": 8,
        "d": 8,
        "w": 60,
        "h": 74,
        "ax": 30,
        "ay": 61,
        "ms": 194,
        "s": 1
      },
      "run": {
        "f": "enemy140_run.webp",
        "n": 8,
        "d": 8,
        "w": 56,
        "h": 75,
        "ax": 28,
        "ay": 65,
        "ms": 125,
        "s": 1
      },
      "at": {
        "f": "enemy140_at.webp",
        "n": 8,
        "d": 8,
        "w": 106,
        "h": 103,
        "ax": 53,
        "ay": 90,
        "ms": 139,
        "s": 1
      },
      "hurt": {
        "f": "enemy140_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 69,
        "h": 77,
        "ax": 34,
        "ay": 64,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy140_die.webp",
        "n": 8,
        "d": 8,
        "w": 146,
        "h": 101,
        "ax": 73,
        "ay": 66,
        "ms": 153,
        "s": 1
      }
    },
    "enemy141": {
      "st": {
        "f": "enemy141_st.webp",
        "n": 7,
        "d": 8,
        "w": 72,
        "h": 81,
        "ax": 30,
        "ay": 69,
        "ms": 270,
        "s": 1
      },
      "run": {
        "f": "enemy141_run.webp",
        "n": 12,
        "d": 8,
        "w": 87,
        "h": 83,
        "ax": 35,
        "ay": 68,
        "ms": 88,
        "s": 1
      },
      "at": {
        "f": "enemy141_at.webp",
        "n": 10,
        "d": 8,
        "w": 212,
        "h": 148,
        "ax": 95,
        "ay": 104,
        "ms": 111,
        "s": 1
      },
      "hurt": {
        "f": "enemy141_hurt.webp",
        "n": 5,
        "d": 8,
        "w": 79,
        "h": 83,
        "ax": 31,
        "ay": 69,
        "ms": 178,
        "s": 1
      },
      "die": {
        "f": "enemy141_die.webp",
        "n": 8,
        "d": 8,
        "w": 215,
        "h": 155,
        "ax": 101,
        "ay": 103,
        "ms": 146,
        "s": 1
      }
    },
    "enemy142": {
      "st": {
        "f": "enemy142_st.webp",
        "n": 12,
        "d": 8,
        "w": 41,
        "h": 70,
        "ax": 21,
        "ay": 61,
        "ms": 157,
        "s": 1
      },
      "run": {
        "f": "enemy142_run.webp",
        "n": 7,
        "d": 8,
        "w": 46,
        "h": 71,
        "ax": 23,
        "ay": 62,
        "ms": 127,
        "s": 1
      },
      "at": {
        "f": "enemy142_at.webp",
        "n": 7,
        "d": 8,
        "w": 88,
        "h": 94,
        "ax": 44,
        "ay": 79,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy142_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 56,
        "h": 73,
        "ax": 28,
        "ay": 64,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy142_die.webp",
        "n": 8,
        "d": 8,
        "w": 147,
        "h": 102,
        "ax": 73,
        "ay": 65,
        "ms": 208,
        "s": 1
      }
    },
    "enemy143": {
      "st": {
        "f": "enemy143_st.webp",
        "n": 8,
        "d": 8,
        "w": 96,
        "h": 79,
        "ax": 48,
        "ay": 71,
        "ms": 250,
        "s": 1
      },
      "run": {
        "f": "enemy143_run.webp",
        "n": 8,
        "d": 8,
        "w": 102,
        "h": 89,
        "ax": 51,
        "ay": 78,
        "ms": 132,
        "s": 1
      },
      "at": {
        "f": "enemy143_at.webp",
        "n": 10,
        "d": 8,
        "w": 178,
        "h": 104,
        "ax": 89,
        "ay": 89,
        "ms": 111,
        "s": 1
      },
      "hurt": {
        "f": "enemy143_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 94,
        "h": 81,
        "ax": 47,
        "ay": 73,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy143_die.webp",
        "n": 7,
        "d": 8,
        "w": 156,
        "h": 122,
        "ax": 78,
        "ay": 86,
        "ms": 222,
        "s": 1
      }
    },
    "enemy144": {
      "st": {
        "f": "enemy144_st.webp",
        "n": 6,
        "d": 8,
        "w": 76,
        "h": 85,
        "ax": 38,
        "ay": 75,
        "ms": 167,
        "s": 1
      },
      "run": {
        "f": "enemy144_run.webp",
        "n": 8,
        "d": 8,
        "w": 82,
        "h": 84,
        "ax": 41,
        "ay": 72,
        "ms": 146,
        "s": 1
      },
      "at": {
        "f": "enemy144_at.webp",
        "n": 9,
        "d": 8,
        "w": 108,
        "h": 106,
        "ax": 54,
        "ay": 94,
        "ms": 123,
        "s": 1
      },
      "hurt": {
        "f": "enemy144_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 72,
        "h": 89,
        "ax": 36,
        "ay": 76,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy144_die.webp",
        "n": 9,
        "d": 8,
        "w": 203,
        "h": 125,
        "ax": 102,
        "ay": 78,
        "ms": 247,
        "s": 1
      }
    },
    "enemy146": {
      "st": {
        "f": "enemy146_st.webp",
        "n": 10,
        "d": 8,
        "w": 74,
        "h": 76,
        "ax": 37,
        "ay": 66,
        "ms": 200,
        "s": 1
      },
      "run": {
        "f": "enemy146_run.webp",
        "n": 8,
        "d": 8,
        "w": 79,
        "h": 80,
        "ax": 39,
        "ay": 67,
        "ms": 146,
        "s": 1
      },
      "at": {
        "f": "enemy146_at.webp",
        "n": 6,
        "d": 8,
        "w": 134,
        "h": 90,
        "ax": 67,
        "ay": 79,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "enemy146_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 70,
        "h": 76,
        "ax": 35,
        "ay": 67,
        "ms": 194,
        "s": 1
      },
      "die": {
        "f": "enemy146_die.webp",
        "n": 8,
        "d": 8,
        "w": 132,
        "h": 112,
        "ax": 66,
        "ay": 75,
        "ms": 250,
        "s": 1
      }
    },
    "enemy147": {
      "st": {
        "f": "enemy147_st.webp",
        "n": 12,
        "d": 8,
        "w": 80,
        "h": 76,
        "ax": 40,
        "ay": 66,
        "ms": 139,
        "s": 1
      },
      "run": {
        "f": "enemy147_run.webp",
        "n": 8,
        "d": 8,
        "w": 69,
        "h": 88,
        "ax": 35,
        "ay": 75,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy147_at.webp",
        "n": 7,
        "d": 8,
        "w": 130,
        "h": 89,
        "ax": 65,
        "ay": 78,
        "ms": 159,
        "s": 1
      },
      "hurt": {
        "f": "enemy147_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 84,
        "h": 80,
        "ax": 42,
        "ay": 70,
        "ms": 185,
        "s": 1
      },
      "die": {
        "f": "enemy147_die.webp",
        "n": 8,
        "d": 8,
        "w": 230,
        "h": 141,
        "ax": 115,
        "ay": 83,
        "ms": 139,
        "s": 1
      }
    },
    "enemy148": {
      "st": {
        "f": "enemy148_st.webp",
        "n": 10,
        "d": 8,
        "w": 89,
        "h": 95,
        "ax": 44,
        "ay": 84,
        "ms": 200,
        "s": 1
      },
      "run": {
        "f": "enemy148_run.webp",
        "n": 7,
        "d": 8,
        "w": 90,
        "h": 96,
        "ax": 45,
        "ay": 85,
        "ms": 151,
        "s": 1
      },
      "at": {
        "f": "enemy148_at.webp",
        "n": 6,
        "d": 8,
        "w": 165,
        "h": 100,
        "ax": 83,
        "ay": 82,
        "ms": 185,
        "s": 1
      },
      "hurt": {
        "f": "enemy148_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 89,
        "h": 104,
        "ax": 44,
        "ay": 93,
        "ms": 259,
        "s": 1
      },
      "die": {
        "f": "enemy148_die.webp",
        "n": 7,
        "d": 8,
        "w": 205,
        "h": 134,
        "ax": 102,
        "ay": 96,
        "ms": 246,
        "s": 1
      }
    },
    "enemy205": {
      "st": {
        "f": "enemy205_st.webp",
        "n": 10,
        "d": 8,
        "w": 116,
        "h": 88,
        "ax": 45,
        "ay": 70,
        "ms": 200,
        "s": 1
      },
      "run": {
        "f": "enemy205_run.webp",
        "n": 8,
        "d": 8,
        "w": 95,
        "h": 101,
        "ax": 48,
        "ay": 86,
        "ms": 69,
        "s": 1
      },
      "at": {
        "f": "enemy205_at.webp",
        "n": 11,
        "d": 8,
        "w": 138,
        "h": 103,
        "ax": 57,
        "ay": 79,
        "ms": 101,
        "s": 1
      },
      "hurt": {
        "f": "enemy205_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 120,
        "h": 101,
        "ax": 48,
        "ay": 80,
        "ms": 139,
        "s": 1
      },
      "die": {
        "f": "enemy205_die.webp",
        "n": 6,
        "d": 8,
        "w": 256,
        "h": 160,
        "ax": 121,
        "ay": 99,
        "ms": 222,
        "s": 1
      }
    },
    "pl_shaolin": {
      "st": {
        "f": "pl_shaolin_st.webp",
        "n": 11,
        "d": 8,
        "w": 64,
        "h": 47,
        "ax": 32,
        "ay": 45,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_shaolin_run.webp",
        "n": 6,
        "d": 8,
        "w": 67,
        "h": 47,
        "ax": 34,
        "ay": 47,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_shaolin_at.webp",
        "n": 7,
        "d": 8,
        "w": 118,
        "h": 66,
        "ax": 59,
        "ay": 64,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_shaolin_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 64,
        "h": 49,
        "ax": 32,
        "ay": 48,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_shaolin_die.webp",
        "n": 6,
        "d": 8,
        "w": 124,
        "h": 72,
        "ax": 62,
        "ay": 53,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_tianwang": {
      "st": {
        "f": "pl_tianwang_st.webp",
        "n": 11,
        "d": 8,
        "w": 74,
        "h": 71,
        "ax": 37,
        "ay": 67,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_tianwang_run.webp",
        "n": 6,
        "d": 8,
        "w": 83,
        "h": 73,
        "ax": 41,
        "ay": 72,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_tianwang_at.webp",
        "n": 6,
        "d": 8,
        "w": 113,
        "h": 74,
        "ax": 56,
        "ay": 67,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_tianwang_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 73,
        "h": 74,
        "ax": 37,
        "ay": 70,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_tianwang_die.webp",
        "n": 6,
        "d": 8,
        "w": 76,
        "h": 59,
        "ax": 38,
        "ay": 42,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_tangmen": {
      "st": {
        "f": "pl_tangmen_st.webp",
        "n": 11,
        "d": 8,
        "w": 26,
        "h": 47,
        "ax": 13,
        "ay": 45,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_tangmen_run.webp",
        "n": 6,
        "d": 8,
        "w": 43,
        "h": 47,
        "ax": 22,
        "ay": 47,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_tangmen_at.webp",
        "n": 8,
        "d": 8,
        "w": 39,
        "h": 66,
        "ax": 20,
        "ay": 64,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_tangmen_hurt.webp",
        "n": 5,
        "d": 8,
        "w": 43,
        "h": 52,
        "ax": 22,
        "ay": 50,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_tangmen_die.webp",
        "n": 6,
        "d": 8,
        "w": 70,
        "h": 63,
        "ax": 35,
        "ay": 50,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_wudu": {
      "st": {
        "f": "pl_wudu_st.webp",
        "n": 11,
        "d": 8,
        "w": 36,
        "h": 61,
        "ax": 18,
        "ay": 58,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_wudu_run.webp",
        "n": 6,
        "d": 8,
        "w": 72,
        "h": 55,
        "ax": 36,
        "ay": 54,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_wudu_at.webp",
        "n": 8,
        "d": 8,
        "w": 90,
        "h": 79,
        "ax": 45,
        "ay": 76,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_wudu_hurt.webp",
        "n": 6,
        "d": 8,
        "w": 37,
        "h": 62,
        "ax": 19,
        "ay": 58,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_wudu_die.webp",
        "n": 9,
        "d": 8,
        "w": 110,
        "h": 83,
        "ax": 55,
        "ay": 59,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_emei": {
      "st": {
        "f": "pl_emei_st.webp",
        "n": 12,
        "d": 8,
        "w": 50,
        "h": 46,
        "ax": 25,
        "ay": 44,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_emei_run.webp",
        "n": 6,
        "d": 8,
        "w": 74,
        "h": 44,
        "ax": 37,
        "ay": 43,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_emei_at.webp",
        "n": 7,
        "d": 8,
        "w": 98,
        "h": 67,
        "ax": 49,
        "ay": 61,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_emei_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 62,
        "h": 47,
        "ax": 31,
        "ay": 45,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_emei_die.webp",
        "n": 8,
        "d": 8,
        "w": 131,
        "h": 75,
        "ax": 66,
        "ay": 49,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_cuiyan": {
      "st": {
        "f": "pl_cuiyan_st.webp",
        "n": 8,
        "d": 8,
        "w": 32,
        "h": 57,
        "ax": 16,
        "ay": 54,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_cuiyan_run.webp",
        "n": 6,
        "d": 8,
        "w": 43,
        "h": 59,
        "ax": 22,
        "ay": 57,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_cuiyan_at.webp",
        "n": 8,
        "d": 8,
        "w": 80,
        "h": 71,
        "ax": 40,
        "ay": 68,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_cuiyan_hurt.webp",
        "n": 3,
        "d": 8,
        "w": 31,
        "h": 58,
        "ax": 16,
        "ay": 55,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_cuiyan_die.webp",
        "n": 5,
        "d": 8,
        "w": 157,
        "h": 92,
        "ax": 79,
        "ay": 58,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_gaibang": {
      "st": {
        "f": "pl_gaibang_st.webp",
        "n": 11,
        "d": 8,
        "w": 58,
        "h": 62,
        "ax": 29,
        "ay": 59,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_gaibang_run.webp",
        "n": 6,
        "d": 8,
        "w": 65,
        "h": 65,
        "ax": 32,
        "ay": 64,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_gaibang_at.webp",
        "n": 6,
        "d": 8,
        "w": 82,
        "h": 79,
        "ax": 41,
        "ay": 68,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_gaibang_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 60,
        "h": 65,
        "ax": 30,
        "ay": 62,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_gaibang_die.webp",
        "n": 6,
        "d": 8,
        "w": 76,
        "h": 59,
        "ax": 38,
        "ay": 43,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_tianren": {
      "st": {
        "f": "pl_tianren_st.webp",
        "n": 11,
        "d": 8,
        "w": 64,
        "h": 47,
        "ax": 32,
        "ay": 45,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_tianren_run.webp",
        "n": 6,
        "d": 8,
        "w": 67,
        "h": 47,
        "ax": 34,
        "ay": 47,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_tianren_at.webp",
        "n": 7,
        "d": 8,
        "w": 118,
        "h": 66,
        "ax": 59,
        "ay": 64,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_tianren_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 64,
        "h": 49,
        "ax": 32,
        "ay": 48,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_tianren_die.webp",
        "n": 6,
        "d": 8,
        "w": 124,
        "h": 72,
        "ax": 62,
        "ay": 53,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_wudang": {
      "st": {
        "f": "pl_wudang_st.webp",
        "n": 11,
        "d": 8,
        "w": 65,
        "h": 47,
        "ax": 32,
        "ay": 45,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_wudang_run.webp",
        "n": 6,
        "d": 8,
        "w": 72,
        "h": 47,
        "ax": 36,
        "ay": 47,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_wudang_at.webp",
        "n": 8,
        "d": 8,
        "w": 97,
        "h": 79,
        "ax": 49,
        "ay": 77,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_wudang_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 65,
        "h": 50,
        "ax": 32,
        "ay": 48,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_wudang_die.webp",
        "n": 6,
        "d": 8,
        "w": 130,
        "h": 75,
        "ax": 65,
        "ay": 53,
        "ms": 100,
        "fixed": 1
      }
    },
    "pl_kunlun": {
      "st": {
        "f": "pl_kunlun_st.webp",
        "n": 11,
        "d": 8,
        "w": 65,
        "h": 47,
        "ax": 32,
        "ay": 45,
        "ms": 143,
        "fixed": 1
      },
      "run": {
        "f": "pl_kunlun_run.webp",
        "n": 6,
        "d": 8,
        "w": 72,
        "h": 47,
        "ax": 36,
        "ay": 47,
        "ms": 71,
        "fixed": 1
      },
      "at": {
        "f": "pl_kunlun_at.webp",
        "n": 8,
        "d": 8,
        "w": 97,
        "h": 79,
        "ax": 49,
        "ay": 77,
        "ms": 62,
        "fixed": 1
      },
      "hurt": {
        "f": "pl_kunlun_hurt.webp",
        "n": 4,
        "d": 8,
        "w": 65,
        "h": 50,
        "ax": 32,
        "ay": 48,
        "ms": 83,
        "fixed": 1
      },
      "die": {
        "f": "pl_kunlun_die.webp",
        "n": 6,
        "d": 8,
        "w": 130,
        "h": 75,
        "ax": 65,
        "ay": 53,
        "ms": 100,
        "fixed": 1
      }
    }
  }
});

window.__HD_ANIM = window.JW.anim;


// Extended Monsters, Serial Maps & Translations
(function () {
    window.JW = window.JW || {};
    window.JW.mon = window.JW.mon || {};
    const s_mon = {
                    675: {
                        n: "Hà Hoa Đạo",
                        img: "img/m/enemy059.png",
                        sz: [36, 67, 18, 67],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "enemy059",
                    },
                    564: {
                        n: "Hoàn Nhan Tuyết Y",
                        img: "img/m/boss014.png",
                        sz: [73, 76, 36, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 12,
                        run: 12,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "boss014",
                    },
                    562: {
                        n: "Đạo Thanh Chân Nhân",
                        img: "img/m/boss001.png",
                        sz: [64, 76, 32, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 12,
                        run: 12,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "boss001",
                    },
                    761: {
                        n: "Nhiệm vụ sát thủ cấp 20",
                        img: "img/m/enemy051.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy051",
                    },
                    762: {
                        n: "Nhiệm vụ sát thủ cấp 30",
                        img: "img/m/enemy051.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy051",
                    },
                    763: {
                        n: "Nhiệm vụ sát thủ cấp 40",
                        img: "img/m/enemy051.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy051",
                    },
                    764: {
                        n: "Nhiệm vụ sát thủ cấp 50",
                        img: "img/m/enemy051.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy051",
                    },
                    765: {
                        n: "Nhiệm vụ sát thủ cấp 60",
                        img: "img/m/enemy051.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy051",
                    },
                    766: {
                        n: "Nhiệm vụ sát thủ cấp 70",
                        img: "img/m/enemy051.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy051",
                    },
                    767: {
                        n: "Nhiệm vụ sát thủ cấp 80",
                        img: "img/m/enemy051.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy051",
                    },
                    768: {
                        n: "Nhiệm vụ sát thủ cấp 90",
                        img: "img/m/enemy051.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy051",
                    },
                    770: {
                        n: "Nhiệm vụ sát thủ cấp 201",
                        img: "img/m/enemy107.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy107",
                    },
                    771: {
                        n: "Nhiệm vụ sát thủ cấp 202",
                        img: "img/m/enemy081.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy081",
                    },
                    772: {
                        n: "Nhiệm vụ sát thủ cấp 203",
                        img: "img/m/enemy109.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy109",
                    },
                    773: {
                        n: "Nhiệm vụ sát thủ cấp 301",
                        img: "img/m/enemy107.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy107",
                    },
                    774: {
                        n: "Nhiệm vụ sát thủ cấp 302",
                        img: "img/m/enemy081.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy081",
                    },
                    775: {
                        n: "Nhiệm vụ sát thủ cấp 303",
                        img: "img/m/enemy109.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy109",
                    },
                    776: {
                        n: "Nhiệm vụ sát thủ cấp 304",
                        img: "img/m/enemy126.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy126",
                    },
                    777: {
                        n: "Nhiệm vụ sát thủ cấp 401",
                        img: "img/m/enemy107.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy107",
                    },
                    778: {
                        n: "Nhiệm vụ sát thủ cấp 402",
                        img: "img/m/enemy081.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy081",
                    },
                    779: {
                        n: "Nhiệm vụ sát thủ cấp 403",
                        img: "img/m/enemy109.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy109",
                    },
                    780: {
                        n: "Nhiệm vụ sát thủ cấp 404",
                        img: "img/m/enemy126.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy126",
                    },
                    781: {
                        n: "Nhiệm vụ sát thủ cấp 405",
                        img: "img/m/enemy089.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy089",
                    },
                    782: {
                        n: "Nhiệm vụ sát thủ cấp 501",
                        img: "img/m/enemy107.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy107",
                    },
                    783: {
                        n: "Nhiệm vụ sát thủ cấp 502",
                        img: "img/m/enemy081.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy081",
                    },
                    784: {
                        n: "Nhiệm vụ sát thủ cấp 503",
                        img: "img/m/enemy109.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy109",
                    },
                    785: {
                        n: "Nhiệm vụ sát thủ cấp 504",
                        img: "img/m/enemy126.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy126",
                    },
                    786: {
                        n: "Nhiệm vụ sát thủ cấp 505",
                        img: "img/m/enemy089.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy089",
                    },
                    787: {
                        n: "Nhiệm vụ sát thủ cấp 506",
                        img: "img/m/enemy070.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy070",
                    },
                    788: {
                        n: "Nhiệm vụ sát thủ cấp 601",
                        img: "img/m/enemy107.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy107",
                    },
                    789: {
                        n: "Nhiệm vụ sát thủ cấp 602",
                        img: "img/m/enemy081.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy081",
                    },
                    790: {
                        n: "Nhiệm vụ sát thủ cấp 603",
                        img: "img/m/enemy109.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy109",
                    },
                    791: {
                        n: "Nhiệm vụ sát thủ cấp 604",
                        img: "img/m/enemy126.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy126",
                    },
                    792: {
                        n: "Nhiệm vụ sát thủ cấp 605",
                        img: "img/m/enemy089.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy089",
                    },
                    793: {
                        n: "Nhiệm vụ sát thủ cấp 606",
                        img: "img/m/enemy070.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy070",
                    },
                    794: {
                        n: "Nhiệm vụ sát thủ cấp 607",
                        img: "img/m/enemy048.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy048",
                    },
                    795: {
                        n: "Nhiệm vụ sát thủ cấp 701",
                        img: "img/m/enemy107.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy107",
                    },
                    796: {
                        n: "Nhiệm vụ sát thủ cấp 702",
                        img: "img/m/enemy081.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy081",
                    },
                    797: {
                        n: "Nhiệm vụ sát thủ cấp 703",
                        img: "img/m/enemy109.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy109",
                    },
                    798: {
                        n: "Nhiệm vụ sát thủ cấp 704",
                        img: "img/m/enemy126.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy126",
                    },
                    799: {
                        n: "Nhiệm vụ sát thủ cấp 705",
                        img: "img/m/enemy089.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy089",
                    },
                    800: {
                        n: "Nhiệm vụ sát thủ cấp 706",
                        img: "img/m/enemy070.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy070",
                    },
                    801: {
                        n: "Nhiệm vụ sát thủ cấp 707",
                        img: "img/m/enemy048.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy048",
                    },
                    802: {
                        n: "Nhiệm vụ sát thủ cấp 708",
                        img: "img/m/enemy082.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy082",
                    },
                    803: {
                        n: "Nhiệm vụ sát thủ cấp 801",
                        img: "img/m/enemy107.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy107",
                    },
                    804: {
                        n: "Nhiệm vụ sát thủ cấp 802",
                        img: "img/m/enemy081.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy081",
                    },
                    805: {
                        n: "Nhiệm vụ sát thủ cấp 803",
                        img: "img/m/enemy109.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy109",
                    },
                    806: {
                        n: "Nhiệm vụ sát thủ cấp 804",
                        img: "img/m/enemy126.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy126",
                    },
                    807: {
                        n: "Nhiệm vụ sát thủ cấp 805",
                        img: "img/m/enemy089.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy089",
                    },
                    808: {
                        n: "Nhiệm vụ sát thủ cấp 806",
                        img: "img/m/enemy070.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy070",
                    },
                    809: {
                        n: "Nhiệm vụ sát thủ cấp 807",
                        img: "img/m/enemy048.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy048",
                    },
                    810: {
                        n: "Nhiệm vụ sát thủ cấp 808",
                        img: "img/m/enemy082.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy082",
                    },
                    811: {
                        n: "Nhiệm vụ sát thủ cấp 809",
                        img: "img/m/enemy050.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy050",
                    },
                    812: {
                        n: "Nhiệm vụ sát thủ cấp 901",
                        img: "img/m/enemy107.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy107",
                    },
                    813: {
                        n: "Nhiệm vụ sát thủ cấp 902",
                        img: "img/m/enemy081.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy081",
                    },
                    814: {
                        n: "Nhiệm vụ sát thủ cấp 903",
                        img: "img/m/enemy109.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy109",
                    },
                    815: {
                        n: "Nhiệm vụ sát thủ cấp 904",
                        img: "img/m/enemy126.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy126",
                    },
                    816: {
                        n: "Nhiệm vụ sát thủ cấp 905",
                        img: "img/m/enemy089.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy089",
                    },
                    817: {
                        n: "Nhiệm vụ sát thủ cấp 906",
                        img: "img/m/enemy070.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy070",
                    },
                    818: {
                        n: "Nhiệm vụ sát thủ cấp 907",
                        img: "img/m/enemy048.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy048",
                    },
                    819: {
                        n: "Nhiệm vụ sát thủ cấp 908",
                        img: "img/m/enemy082.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy082",
                    },
                    820: {
                        n: "Nhiệm vụ sát thủ cấp 909",
                        img: "img/m/enemy050.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 15,
                        run: 12,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy050",
                    },
                    543: {
                        n: "Thác Nhĩ Hán",
                        img: "img/m/enemy085.png",
                        sz: [34, 74, 17, 74],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 16,
                        run: 5,
                        rmax: [75, 75, 75, 75, 75],
                        anim: "enemy085",
                    },
                    552: {
                        n: "Thứu thần",
                        img: "img/m/ani042.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 12,
                        run: 8,
                        rmax: [75, 75, 75, 75, 75],
                        anim: "ani042",
                    },
                    52: {
                        n: "Bát Bì",
                        img: "img/m/enemy016.png",
                        sz: [41, 76, 20, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 90, 75, 60, 75],
                        anim: "enemy016",
                    },
                    581: {
                        n: "Thứu Thần",
                        img: "img/m/ani042.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 9,
                        run: 8,
                        rmax: [75, 75, 75, 75, 75],
                        anim: "ani042",
                    },
                    559: {
                        n: "Thanh Phong",
                        img: "img/m/enemy137.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 90],
                        anim: "enemy137",
                    },
                    561: {
                        n: "Lưu Vân",
                        img: "img/m/enemy121.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 90, 75, 60, 75],
                        anim: "enemy121",
                    },
                    560: {
                        n: "Lưu Quang",
                        img: "img/m/enemy141.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 90],
                        anim: "enemy141",
                    },
                    566: {
                        n: "Cổ Bách",
                        img: "img/m/boss018.png",
                        sz: [63, 76, 31, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 12,
                        run: 18,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "boss018",
                    },
                    563: {
                        n: "Gia Luật Tị Ly",
                        img: "img/m/boss011.png",
                        sz: [45, 76, 22, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 12,
                        run: 12,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "boss011",
                    },
                    542: {
                        n: "Quỷ Ảnh Hoàn Nhan Cốt",
                        img: "img/m/enemy105.png",
                        sz: [38, 75, 19, 75],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 16,
                        run: 5,
                        rmax: [100, 100, 100, 100, 100],
                        anim: "enemy105",
                    },
                    536: {
                        n: "Tật Vũ",
                        img: "img/m/enemy144.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 90],
                        anim: "enemy144",
                    },
                    535: {
                        n: "Tật Phong",
                        img: "img/m/enemy157.png",
                        sz: [47, 71, 23, 71],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 90],
                        anim: "enemy157",
                    },
                    538: {
                        n: "Tật Điện",
                        img: "img/m/enemy127.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 90],
                        anim: "enemy127",
                    },
                    537: {
                        n: "Tật Viêm",
                        img: "img/m/enemy136.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 5,
                        rmax: [75, 75, 75, 75, 75],
                        anim: "enemy136",
                    },
                    534: {
                        n: "Tật Vũ",
                        img: "img/m/enemy174.png",
                        sz: [27, 70, 13, 70],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 90],
                        anim: "enemy174",
                    },
                    565: {
                        n: "Đoan Mộc Duệ",
                        img: "img/m/boss015.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 12,
                        run: 12,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "boss015",
                    },
                    38: {
                        n: "Kim Tơ Hầu",
                        img: "img/m/ani056.png",
                        sz: [31, 36, 15, 36],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [90, 75, 60, 75, 75],
                        anim: "ani056",
                    },
                    412: {
                        n: "Ác Ni",
                        img: "img/m/enemy177.png",
                        sz: [42, 66, 21, 66],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy177",
                    },
                    32: { n: "Xá Lị", img: "img/m/ani050.png", sz: [17, 34, 8, 34], ranged: 0, sk: [53, 53, 53, 53], spd: 18, run: 6, rmax: [75, 75, 75, 90, 60], anim: "ani050" },
                    568: {
                        n: "Hà Linh Phiêu",
                        img: "img/m/boss002.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 12,
                        run: 12,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "boss002",
                    },
                    545: {
                        n: "Lôi Bộ Cuồng Lang",
                        img: "img/m/enemy078.png",
                        sz: [39, 74, 19, 74],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 16,
                        run: 5,
                        rmax: [75, 75, 75, 75, 90],
                        anim: "enemy078",
                    },
                    164: {
                        n: "sơn tặc 02",
                        img: "img/m/enemy145.png",
                        sz: [47, 73, 23, 73],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 60, 90, 75, 75],
                        anim: "enemy145",
                    },
                    168: {
                        n: "sơn tặc 06",
                        img: "img/m/enemy149.png",
                        sz: [39, 76, 19, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [90, 75, 60, 75, 75],
                        anim: "enemy149",
                    },
                    169: {
                        n: "sơn tặc 07",
                        img: "img/m/enemy150.png",
                        sz: [30, 70, 15, 70],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 60, 90, 75, 75],
                        anim: "enemy150",
                    },
                    44: {
                        n: "Bọ cạp",
                        img: "img/m/ani065.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 60, 90, 75, 75],
                        anim: "ani065",
                    },
                    554: {
                        n: "Tuyết Báo vương",
                        img: "img/m/ani006.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 9,
                        run: 6,
                        rmax: [75, 60, 90, 75, 75],
                        anim: "ani006",
                    },
                    57: {
                        n: "Kim Phó tướng 2",
                        img: "img/m/enemy024.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 90, 75, 60, 75],
                        anim: "enemy024",
                    },
                    166: {
                        n: "sơn tặc 04",
                        img: "img/m/enemy147.png",
                        sz: [49, 74, 24, 74],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [60, 75, 75, 75, 90],
                        anim: "enemy147",
                    },
                    556: {
                        n: "Xích Luyện Xà",
                        img: "img/m/ani039.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 16,
                        run: 4,
                        rmax: [75, 75, 75, 75, 90],
                        anim: "ani039",
                    },
                    567: {
                        n: "Chung Linh Tú",
                        img: "img/m/boss005.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 12,
                        run: 12,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "boss005",
                    },
                    51: {
                        n: "Ác bá",
                        img: "img/m/enemy007.png",
                        sz: [39, 68, 19, 68],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 60, 90, 75, 75],
                        anim: "enemy007",
                    },
                    176: {
                        n: "Quái nhân",
                        img: "img/m/enemy157.png",
                        sz: [47, 71, 23, 71],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 75],
                        anim: "enemy157",
                    },
                    192: {
                        n: "Nữ Thích Khách",
                        img: "img/m/enemy173.png",
                        sz: [27, 73, 13, 73],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 75],
                        anim: "enemy173",
                    },
                    190: {
                        n: "Mộc nhân",
                        img: "img/m/enemy171.png",
                        sz: [60, 69, 30, 69],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [85, 85, 85, 85, 85],
                        anim: "enemy171",
                    },
                    191: {
                        n: "Đồng Nhân",
                        img: "img/m/enemy172.png",
                        sz: [38, 64, 19, 64],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [95, 95, 95, 95, 95],
                        anim: "enemy172",
                    },
                    674: {
                        n: "Thủy Tặc",
                        img: "img/m/enemy205.png",
                        sz: [70, 76, 35, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 75],
                        anim: "enemy205",
                    },
                    708: {
                        n: "Lãnh Thương",
                        img: "img/m/enemy036.png",
                        sz: [34, 76, 17, 76],
                        ranged: 0,
                        sk: [53, 53, 53, 53],
                        spd: 18,
                        run: 6,
                        rmax: [75, 75, 75, 75, 75],
                        anim: "enemy036",
                    },
                };
    const s_ser = {
                    0: 0,
                    1: 1,
                    2: 2,
                    3: 3,
                    4: 4,
                    5: 0,
                    6: 1,
                    7: 2,
                    8: 3,
                    9: 4,
                    10: 0,
                    11: 1,
                    12: 2,
                    13: 3,
                    14: 4,
                    15: 0,
                    16: 1,
                    17: 2,
                    18: 3,
                    19: 4,
                    20: 0,
                    21: 1,
                    22: 2,
                    23: 3,
                    24: 4,
                    25: 0,
                    26: 1,
                    27: 2,
                    28: 3,
                    29: 4,
                    30: 0,
                    31: 1,
                    33: 3,
                    34: 4,
                    35: 0,
                    36: 1,
                    37: 2,
                    39: 4,
                    40: 0,
                    41: 1,
                    42: 2,
                    43: 3,
                    45: 0,
                    46: 1,
                    140: 0,
                    141: 1,
                    142: 2,
                    143: 3,
                    144: 4,
                    145: 0,
                    146: 1,
                    147: 2,
                    148: 3,
                    149: 4,
                    150: 0,
                    151: 1,
                    152: 2,
                    153: 3,
                    154: 4,
                    155: 0,
                    156: 1,
                    157: 2,
                    158: 3,
                    159: 4,
                    160: 0,
                    161: 1,
                    162: 2,
                    163: 3,
                    165: 0,
                    167: 0,
                    557: 3,
                    558: 4,
                    588: 0,
                    589: 0,
                    590: 0,
                    591: 0,
                    592: 0,
                    593: 0,
                    594: 0,
                    595: 0,
                    596: 0,
                    597: 0,
                    598: 0,
                    599: 0,
                    600: 0,
                    601: 0,
                    602: 4,
                    699: 0,
                    700: 0,
                    701: 0,
                    703: 0,
                    704: 0,
                    705: 0,
                    706: 0,
                    707: 0,
                    709: 0,
                    710: 0,
                    711: 0,
                    712: 0,
                    713: 0,
                    716: 0,
                    717: 0,
                    720: 0,
                    851: 0,
                    852: 0,
                    853: 0,
                    854: 0,
                    855: 0,
                    856: 0,
                    857: 0,
                    858: 0,
                    675: 4,
                    564: 3,
                    562: 4,
                    761: 0,
                    762: 0,
                    763: 0,
                    764: 0,
                    765: 0,
                    766: 0,
                    767: 0,
                    768: 0,
                    770: 0,
                    771: 0,
                    772: 0,
                    773: 0,
                    774: 0,
                    775: 0,
                    776: 0,
                    777: 0,
                    778: 0,
                    779: 0,
                    780: 0,
                    781: 0,
                    782: 0,
                    783: 0,
                    784: 0,
                    785: 0,
                    786: 0,
                    787: 0,
                    788: 0,
                    789: 0,
                    790: 0,
                    791: 0,
                    792: 0,
                    793: 0,
                    794: 0,
                    795: 0,
                    796: 0,
                    797: 0,
                    798: 0,
                    799: 0,
                    800: 0,
                    801: 0,
                    802: 0,
                    803: 0,
                    804: 0,
                    805: 0,
                    806: 0,
                    807: 0,
                    808: 0,
                    809: 0,
                    810: 0,
                    811: 0,
                    812: 0,
                    813: 0,
                    814: 0,
                    815: 0,
                    816: 0,
                    817: 0,
                    818: 0,
                    819: 0,
                    820: 0,
                    543: 0,
                    552: 2,
                    52: 2,
                    581: 0,
                    559: 4,
                    561: 3,
                    560: 1,
                    566: 0,
                    563: 3,
                    542: 1,
                    536: 0,
                    535: 1,
                    538: 4,
                    537: 3,
                    534: 2,
                    565: 3,
                    38: 3,
                    412: 0,
                    32: 2,
                    568: 2,
                    545: 4,
                    164: 4,
                    168: 0,
                    169: 0,
                    44: 4,
                    554: 2,
                    57: 2,
                    166: 0,
                    556: 1,
                    567: 2,
                    51: 1,
                    176: 0,
                    192: 0,
                    190: 0,
                    191: 0,
                    674: 4,
                    708: 0,
                };
    const s_vn = {
                    0: "Đông Bắc hổ",
                    1: "Hoa Nam hổ",
                    2: "Bạch hổ",
                    3: "Kim Tiền báo",
                    4: "Tuyết Báo",
                    5: "Sói xám",
                    6: "Sói đỏ",
                    7: "Thanh Lang",
                    8: "Sói tuyết",
                    9: "Hồ ly",
                    10: "Hồng Hồ",
                    11: "Heo rừng",
                    12: "Nhím",
                    13: "Voi Châu á",
                    14: "Voi Hoàng hà",
                    15: "Gấu nâu",
                    16: "Gấu đen",
                    17: "Trâu rừng",
                    18: "Cá sấu",
                    19: "Thằn lằn đỏ",
                    20: "Nhãn Kính Mãng xà",
                    21: "Rắn xanh",
                    22: "Kim Hoàn Mãng Xà",
                    23: "Xích Luyện mãng xà",
                    24: "Kim Điêu",
                    25: "Thương ưng",
                    26: "Kên kên",
                    27: "Dơi chúa",
                    28: "Dơi chúa đỏ",
                    29: "Dơi Dong",
                    30: "Dơi hút máu",
                    31: "Kim Miêu",
                    33: "Hoán hùng",
                    34: "Linh Miêu",
                    35: "Tàng Vực hầu",
                    36: "Khôi Diệp hầu",
                    37: "Hắc Diệp Hầu",
                    39: "Sài",
                    40: "Tuyết Quái",
                    41: "Cóc",
                    42: "Hươu đốm",
                    43: "Heo trắng",
                    45: "Nhện",
                    46: "Rết",
                    140: "Tây Bắc sơn tặc đầu lĩnh",
                    141: "Tây Nam sơn tặc đầu lĩnh",
                    142: "Giang Nam sơn tặc đầu lĩnh",
                    143: "Đông Bắc sơn tặc đầu lĩnh",
                    144: "Hoa Bắc sơn tặc đầu lĩnh",
                    145: "Nam bộ sơn tặc đầu lĩnh",
                    146: "Trung Nguyên sơn tặc đầu lĩnh",
                    147: "Sơn tặc đầu lĩnh1",
                    148: "Sơn tặc đầu lĩnh2",
                    149: "Tây Bắc sơn tặc 1",
                    150: "Tây Bắc sơn tặc 2",
                    151: "Tây Nam sơn tặc 1",
                    152: "Tây Nam sơn tặc 2",
                    153: "Giang Nam sơn tặc 1",
                    154: "Giang Nam sơn tặc 2",
                    155: "Hoa Nam sơn tặc 1",
                    156: "Hoa Nam sơn tặc 2",
                    157: "Đông Bắc sơn tặc 1",
                    158: "Đông Bắc sơn tặc 2",
                    159: "Hoa Bắc sơn tặc 1",
                    160: "Hoa Bắc sơn tặc 2",
                    161: "Trung Nguyên sơn tặc 1",
                    162: "Trung Nguyên sơn tặc 2",
                    163: "Sơn tặc 01",
                    165: "Sơn tặc 03",
                    167: "Sơn tặc 05",
                    557: "Kim Điêu",
                    558: "Bò cạp",
                    588: "Ngọc Hoành Tử",
                    589: "Kim Phó tướng 1",
                    590: "Đông Bắc hổ",
                    591: "Đường Nhất Trần",
                    592: "Hỏa Đường chủ",
                    593: "Kim Phó tướng 2",
                    594: "Sơn tặc đầu lĩnh1",
                    595: "Tống Phó tướng 1",
                    596: "Kim thương quân 2",
                    597: "Tống đao binh 1",
                    598: "Kim Phó tướng 2",
                    599: "Kim Cung binh 2",
                    600: "Địa Hộ pháp",
                    601: "Giới Luật Viện đầu tọa",
                    602: "Phiến Khách",
                    699: "Thi Nghi Sinh",
                    700: "Chính Võ Sĩ",
                    701: "Nguyễn Minh Viễn",
                    703: "Phi Sa",
                    704: "Tẩu Thạch",
                    705: "Sa Đạo",
                    706: "Mạc Tặc",
                    707: "Thần Tý",
                    709: "Liệt Không Mạc Bắc Thảo Nguyên",
                    710: "Kinh Phong Mạc Bắc Thảo Nguyên",
                    711: "Phục Ba Kim sơn đảo",
                    712: "Phá Lang Kim sơn đảo",
                    713: "Thừa Phong Kim sơn đảo",
                    716: "Hạ Hầu Phục",
                    717: "Tiếu Vô Thường",
                    720: "Lục Phi",
                    851: "Tiểu Boss cấp 20",
                    852: "Tiểu Boss cấp 30",
                    853: "Tiểu Boss cấp 40",
                    854: "Tiểu Boss cấp 50",
                    855: "Tiểu Boss cấp 60",
                    856: "Tiểu Boss cấp 70",
                    857: "Tiểu Boss cấp 80",
                    858: "Tiểu Boss cấp 90",
                    675: "Hà Hoa Đạo",
                    761: "Nhiệm vụ sát thủ cấp 20",
                    762: "Nhiệm vụ sát thủ cấp 30",
                    763: "Nhiệm vụ sát thủ cấp 40",
                    764: "Nhiệm vụ sát thủ cấp 50",
                    765: "Nhiệm vụ sát thủ cấp 60",
                    766: "Nhiệm vụ sát thủ cấp 70",
                    767: "Nhiệm vụ sát thủ cấp 80",
                    768: "Nhiệm vụ sát thủ cấp 90",
                    770: "Nhiệm vụ sát thủ cấp 201",
                    771: "Nhiệm vụ sát thủ cấp 202",
                    772: "Nhiệm vụ sát thủ cấp 203",
                    773: "Nhiệm vụ sát thủ cấp 301",
                    774: "Nhiệm vụ sát thủ cấp 302",
                    775: "Nhiệm vụ sát thủ cấp 303",
                    776: "Nhiệm vụ sát thủ cấp 304",
                    777: "Nhiệm vụ sát thủ cấp 401",
                    778: "Nhiệm vụ sát thủ cấp 402",
                    779: "Nhiệm vụ sát thủ cấp 403",
                    780: "Nhiệm vụ sát thủ cấp 404",
                    781: "Nhiệm vụ sát thủ cấp 405",
                    782: "Nhiệm vụ sát thủ cấp 501",
                    783: "Nhiệm vụ sát thủ cấp 502",
                    784: "Nhiệm vụ sát thủ cấp 503",
                    785: "Nhiệm vụ sát thủ cấp 504",
                    786: "Nhiệm vụ sát thủ cấp 505",
                    787: "Nhiệm vụ sát thủ cấp 506",
                    788: "Nhiệm vụ sát thủ cấp 601",
                    789: "Nhiệm vụ sát thủ cấp 602",
                    790: "Nhiệm vụ sát thủ cấp 603",
                    791: "Nhiệm vụ sát thủ cấp 604",
                    792: "Nhiệm vụ sát thủ cấp 605",
                    793: "Nhiệm vụ sát thủ cấp 606",
                    794: "Nhiệm vụ sát thủ cấp 607",
                    795: "Nhiệm vụ sát thủ cấp 701",
                    796: "Nhiệm vụ sát thủ cấp 702",
                    797: "Nhiệm vụ sát thủ cấp 703",
                    798: "Nhiệm vụ sát thủ cấp 704",
                    799: "Nhiệm vụ sát thủ cấp 705",
                    800: "Nhiệm vụ sát thủ cấp 706",
                    801: "Nhiệm vụ sát thủ cấp 707",
                    802: "Nhiệm vụ sát thủ cấp 708",
                    803: "Nhiệm vụ sát thủ cấp 801",
                    804: "Nhiệm vụ sát thủ cấp 802",
                    805: "Nhiệm vụ sát thủ cấp 803",
                    806: "Nhiệm vụ sát thủ cấp 804",
                    807: "Nhiệm vụ sát thủ cấp 805",
                    808: "Nhiệm vụ sát thủ cấp 806",
                    809: "Nhiệm vụ sát thủ cấp 807",
                    810: "Nhiệm vụ sát thủ cấp 808",
                    811: "Nhiệm vụ sát thủ cấp 809",
                    812: "Nhiệm vụ sát thủ cấp 901",
                    813: "Nhiệm vụ sát thủ cấp 902",
                    814: "Nhiệm vụ sát thủ cấp 903",
                    815: "Nhiệm vụ sát thủ cấp 904",
                    816: "Nhiệm vụ sát thủ cấp 905",
                    817: "Nhiệm vụ sát thủ cấp 906",
                    818: "Nhiệm vụ sát thủ cấp 907",
                    819: "Nhiệm vụ sát thủ cấp 908",
                    820: "Nhiệm vụ sát thủ cấp 909",
                    543: "Thác Nhĩ Hán",
                    552: "Đại Điêu",
                    52: "Kim Bộ khoái 2",
                    581: "Thứu Thần",
                    559: "Võ Đang Thị Đồng Thanh Phong",
                    561: "Tây Bắc sơn tặc đầu lĩnh",
                    560: "Kim Phó tướng 2",
                    542: "Quỷ ảnh Hoàn Nhan Cốt",
                    536: "Sơn tặc 01",
                    535: "Quái nhân",
                    538: "Trung Nguyên sơn tặc đầu lĩnh",
                    537: "Hoa Nam sơn tặc 1",
                    534: "Ni Cô Thanh Hòa",
                    38: "Kim Tơ Hầu",
                    412: "Ni cô chiến đấu",
                    32: "Xá Lị",
                    545: "Lôi Bộ Cuồng Lang",
                    164: "Sơn tặc 02",
                    168: "Sơn tặc 06",
                    169: "Sơn tặc 07",
                    44: "Bò cạp",
                    554: "Tuyết Báo vương",
                    57: "Kim Phó tướng 2",
                    166: "Sơn tặc 04",
                    556: "Kim Hoàn Mãng Xà",
                    51: "Tống Sai dịch 1",
                    176: "Quái nhân",
                    192: "Nữ Thích Khách",
                    190: "Mộc nhân",
                    191: "Đồng Nhân",
                    674: "Thủy Tặc",
                    708: "Lãnh Thương",
                };

    Object.assign(window.JW.mon, s_mon);
    for (const A in s_ser) window.JW.mon[A] && (window.JW.mon[A].s = s_ser[A]);
    for (const A in s_vn) window.JW.mon[A] && (window.JW.mon[A].n = s_vn[A]);
})();
